{
    "changelog.md": {
        "Changelog Virtuel": "Changelog Virtual",
        "Pour rappel s'il n'y a pas d'information sur la mise à jour, c'est que celle-ci concerne uniquement de la mise à jour de documentation, de traduction ou de texte": "Zur Erinnerung: Wenn keine Informationen zum Update vorhanden sind, bedeutet dies, dass es sich nur um die Aktualisierung von Dokumentation, Übersetzung oder Text handelt",
        "16\/05\/2020": "16.05.2020",
        "Correction d'un soucis de remonté en double des commandes de type information": "Behebung eines Problems mit doppelten Befehlen vom Typ Information",
        "23\/10\/2019": "23.10.2019",
        "Mise à jour de la doc": "Aktualisieren des Dokuments",
        "Supression forcé des \" lors d'un calcul sur une commande": "Erzwungenes Löschen von \"während einer Berechnung einer Bestellung",
        "Correction de bug de calcul si le résultat à pour valeur\"Faux": "Korrektur des Berechnungsfehlers, wenn das Ergebnis \"False\" ist",
        "10\/09\/2019": "09\/10\/2019",
        "Correction de l'arrondit forcé sur 2 chiffres sur les commandes numérique": "Korrektur der erzwungenen Rundung auf 2 Stellen bei digitalen Steuerungen",
        "Ajout d'un systeme de template pour créer des équipements rapidement": "Hinzufügen eines Vorlagensystems zum schnellen Erstellen von Geräten",
        "Correction de bugs": "Fehlerbehebungen",
        "26\/04\/2019": "26.04.2019",
        "22\/03\/2019": "22.03.2019",
        "Ajout d'une securité en cas de boucle infini": "Zusätzliche Sicherheit bei Endlosschleife",
        "18\/03\/2019": "18.03.2019",
        "13\/03\/2019": "13.03.2019",
        "22\/01\/2019": "22.01.2019",
        "21\/01\/2019": "21.01.2019",
        "Correction d'un bug sur les valeurs déclenchant une mise à jour d'une commande info": "Korrektur eines Fehlers bei den Werten, der eine Aktualisierung eines Infobefehls auslöst",
        "Correction de l'erreur lors de la copie d'un équipement si la commande Rafraichir existe": "Korrektur des Fehlers beim Kopieren eines Geräts, wenn der Befehl Aktualisieren vorhanden ist",
        "Ajout du testeur d'expressions": "Zugabe des Expressionstesters",
        " IMPORTANT.": " Wichtig.",
        " IMPORTANT?": " Wichtig?",
        "IMPORTANT ": "Wichtig ",
        "[IMPORTANT": "[Wichtig",
        "IMPORTANT]": "Wichtig]",
        "*IMPORTANT": "*Wichtig",
        "IMPORTANT*": "Wichtig*",
        " Optimisation.": " Optimierung.",
        " Optimisation?": " Optimierung?",
        "Optimisation ": "Optimierung ",
        "[Optimisation": "[Optimierung",
        "Optimisation]": "Optimierung]",
        "*Optimisation": "*Optimierung",
        "Optimisation*": "Optimierung*"
    },
    "index.md": {
        "Plugin Virtuel": "Virtuelles Plugin",
        "Le plugin Virtual (virtuel) permet la création de périphériques virtuels et de leurs propriétés": "Das virtuelle Plugin ermöglicht die Erstellung virtueller Geräte und ihrer Eigenschaften",
        "Nous nommerons un périphérique créé par ce plugin": "Wir werden ein Gerät benennen, das von diesem Plugin erstellt wurde",
        "périphérique virtuel": "virtuelles Gerät",
        "Un périphérique virtuel peut être créé pour les besoins suivants": "Ein virtuelles Gerät kann für die folgenden Anforderungen erstellt werden",
        "consolider dans un seul périphérique des informations ou actions de plusieurs périphériques physiques\/virtuels ;": "Konsolidieren von Informationen oder Aktionen von mehreren physischen \/ virtuellen Geräten zu einem einzigen Gerät;",
        "créer un périphérique alimenté par une source externe à Jeedom (Zibase, IPX800…) ;": "Erstellen Sie ein Peripheriegerät, das von einer Quelle außerhalb von Jeedom (Zibase, IPX800 usw.) gespeist wird",
        "dupliquer un équipement pour le scinder en 2 par exemple ;": "doppelte Ausrüstung, um sie beispielsweise in zwei Teile zu teilen;",
        "effectuer un calcul sur plusieurs valeurs d'équipements ;": "eine Berechnung für mehrere Gerätewerte durchführen;",
        "exécuter de multiples actions (macro)": "mehrere Aktionen ausführen (Makro)",
        "Le plugin ne nécessite aucune configuration, il faut juste l'activer": "Das Plugin benötigt keine Konfiguration, Sie müssen es nur aktivieren",
        "Configuration des équipements": "Gerätekonfiguration",
        "La configuration des équipements virtuels est accessible à partir du menu plugin": "Auf die Konfiguration virtueller Geräte kann über das Plugin-Menü zugegriffen werden",
        "Voilà à quoi ressemble la page du plugin virtuel (ici avec déjà un équipement)": "So sieht die virtuelle Plugin-Seite aus (hier mit bereits vorhandenem Gerät)",
        "Voilà à quoi ressemble la page de configuration d'un équipement virtuel": "So sieht die Konfigurationsseite eines virtuellen Geräts aus",
        "Comme à beaucoup d'endroits sur Jeedom, mettre la souris tout à gauche permet de faire apparaître un menu d'accès rapide (vous pouvez à partir de votre profil le laisser toujours visible)": "Wie an vielen Stellen in Jeedom wird durch einfaches Bewegen der Maus ganz links ein Schnellzugriffsmenü angezeigt (Sie können es jederzeit in Ihrem Profil sichtbar lassen)",
        "Vous retrouvez ici toute la configuration de votre équipement": "Hier finden Sie die gesamte Konfiguration Ihrer Geräte",
        "Nom de l'équipement virtuel": "Name des virtuellen Geräts",
        "nom de votre équipement virtuel": "Name Ihrer virtuellen Ausrüstung",
        "Objet parent": "Übergeordnetes Objekt",
        "indique l'objet parent auquel appartient l'équipement": "Gibt das übergeordnete Objekt an, zu dem das Gerät gehört",
        "Catégorie": "Kategorie",
        "les catégories de l'équipement (il peut appartenir à plusieurs catégories)": "Gerätekategorien (es kann zu mehreren Kategorien gehören)",
        "permet de rendre votre équipement actif": "macht Ihre Ausrüstung aktiv",
        "le rend visible sur le dashboard": "macht es auf dem Dashboard sichtbar",
        "vous permet de mettre des commentaires sur l'équipement": "ermöglicht es Ihnen, Geräte zu kommentieren",
        "En haut à droite vous avez accès à 4 boutons": "Oben rechts haben Sie Zugriff auf 4 Schaltflächen",
        "le testeur d'expressions identique à celui des scénarios pour vous faciliter la mise au point de certains virtuels": "Der Ausdruckstester ist mit dem der Szenarien identisch, um die Entwicklung einiger virtueller Systeme zu erleichtern",
        "Importer équipement": "Ausrüstung importieren",
        "permet de dupliquer automatiquement un équipement existant dans un virtuel (permet de gagner du temps pour scinder un équipement en 2 par exemple)": "Ermöglicht das automatische Duplizieren eines vorhandenen Geräts in ein virtuelles Gerät (spart Zeit, um ein Gerät beispielsweise in zwei Teile zu teilen)",
        "permet de dupliquer l'équipement courant": "dupliziert aktuelle Geräte",
        "Avancée (roues crantées)": "Fortgeschrittene (gekerbte Räder)",
        "permet d'afficher les options avancées de l'équipement (commun à tous les plugins Jeedom)": "zeigt erweiterte Ausstattungsoptionen an (allen Jeedom-Plugins gemeinsam)",
        "En-dessous vous retrouvez la liste des commandes": "Nachfolgend finden Sie die Liste der Bestellungen",
        "le nom affiché sur le dashboard": "Der im Dashboard angezeigte Name",
        "le type et le sous-type": "Typ und Subtyp",
        "la valeur": "der Wert",
        "permet de donner la valeur de la commande en fonction d'une autre commande, d'une clef (quand on fait un interrupteur virtuel), d'un calcul, etc": "ermöglicht es, den Wert des Befehls gemäß einem anderen Befehl, einem Schlüssel (wenn wir einen virtuellen Wechsel vornehmen), einer Berechnung usw. anzugeben",
        "Valeur de retour d'état\" et \"Durée avant retour d'état": "Statusrückmeldungswert \"und\" Dauer vor Statusrückmeldung",
        "permet d'indiquer à Jeedom qu'après un changement sur l'information sa valeur doit revenir à Y, X min après le changement": "ermöglicht es Jeedom anzuzeigen, dass nach einer Änderung der Informationen der Wert auf Y, X min nach der Änderung zurückkehren muss",
        "dans le cas d'un détecteur de présence qui n'émet que lors d'une détection de présence, il est utile de mettre par exemple 0 en valeur et 4 en durée, pour que 4 mn après une détection de mouvement (et s'il n'y a en pas eu de nouvelle(s) depuis) Jeedom remette la valeur de l'information à 0 (plus de mouvement détecté)": "Im Fall eines Anwesenheitsdetektors, der nur während einer Anwesenheitserkennung emittiert, ist es nützlich, beispielsweise 0 im Wert und 4 in der Dauer einzustellen, so dass 4 Minuten nach einer Bewegungserkennung (und s ') Seitdem gab es keine Neuigkeiten.) Jeedom setzt den Wert der Informationen auf 0 zurück (mehr Bewegung erkannt)",
        "unité de la donnée (peut être vide)": "Dateneinheit (kann leer sein)",
        "permet d'historiser la donnée": "ermöglicht das Historisieren der Daten",
        "permet d'afficher la donnée sur le dashboard": "ermöglicht die Anzeige der Daten im Dashboard",
        "événement": "Ereignis",
        "dans le cas du RFXcom cette case doit toujours être cochée car on ne peut pas interroger un module RFXcom": "Bei RFXcom muss dieses Kontrollkästchen immer aktiviert sein, da Sie ein RFXcom-Modul nicht abfragen können",
        "min\/max": "min \/ max",
        "bornes de la donnée (peuvent être vides)": "Datengrenzen (können leer sein)",
        "configuration avancée (petites roues crantées)": "erweiterte Konfiguration (kleine gekerbte Räder)",
        "permet d'afficher la configuration avancée de la commande (méthode d'historisation, widget, etc.)": "Zeigt die erweiterte Konfiguration des Befehls an (Protokollierungsmethode, Widget usw.)",
        "permet de tester la commande": "Wird zum Testen des Befehls verwendet",
        "supprimer (signe -)": "löschen (unterschreiben -)",
        "permet de supprimer la commande": "ermöglicht das Löschen des Befehls",
        "Interrupteur virtuel": "Virtueller Switch",
        "Pour faire un interrupteur virtuel, il vous faut ajouter 2 commandes virtuelles comme cela": "Um einen virtuellen Wechsel vorzunehmen, müssen Sie zwei virtuelle Befehle wie diesen hinzufügen",
        "Puis vous sauvegardez et là Jeedom va automatiquement ajouter la commande d'information virtuelle": "Dann speichern Sie und dort fügt Jeedom automatisch den Befehl für virtuelle Informationen hinzu",
        "Ajoutez dans les commandes \"action": "Fügen Sie in der Bestellung \"Aktion hinzu",
        "la commande": "Die Bestellung",
        "(cela permet à Jeedom de faire le lien avec la commande état)": "(Dadurch kann Jeedom die Verknüpfung mit dem Statusbefehl herstellen.)",
        "Pour avoir un joli widget, il vous faut masquer la commande d'état": "Um ein schönes Widget zu haben, müssen Sie den Statusbefehl ausblenden",
        "Affectez un widget qui gère le retour d'état aux 2 commandes d'action, par exemple ici le widget light": "Weisen Sie den beiden Aktionsbefehlen ein Widget zu, das die Statusrückmeldung verwaltet, z. B. hier das Licht-Widget",
        "Pour ce faire cliquez sur la petite roue crantée en face de la commande": "Klicken Sie dazu auf das kleine gekerbte Rad vor der Steuerung",
        "et dans le 2ème onglet sélectionnez": "und auf der 2. Registerkarte auswählen",
        "comme widget": "als Widget",
        "Enregistrez et faites de même pour la commande": "Speichern Sie und machen Sie dasselbe für die Bestellung",
        "Et vous obtiendrez un joli widget qui changera d'état lors d'un clic": "Und Sie erhalten ein nettes Widget, das beim Klicken den Status ändert",
        "Slider virtuel": "Virtueller Schieberegler",
        "Pour faire un slider virtuel, il faut ajouter une commande virtuelle comme cela": "Fügen Sie einen virtuellen Befehl wie diesen hinzu, um einen virtuellen Schieberegler zu erstellen",
        "Comme tout à l'heure après la sauvegarde, Jeedom va automatiquement créer la commande info": "Wie zuvor nach der Sicherung erstellt Jeedom automatisch den Befehl info",
        "Et comme tout à l'heure il est conseillé de lier l'action à la commande d'état et de masquer celle-ci": "Nach wie vor ist es ratsam, die Aktion mit dem Statusbefehl zu verknüpfen und auszublenden",
        "Interrupteur de type toggle": "Kippschalter",
        "Voilà comment faire un interrupteur de type toggle, pour cela il faut créer une commande virtuelle de ce type": "Auf diese Weise können Sie einen Schalter vom Typ umschalten. Dazu müssen Sie einen virtuellen Befehl dieses Typs erstellen",
        "Ensuite vous sauvegardez pour voir apparaître la commande d'état": "Anschließend speichern Sie, um den Statusbefehl anzuzeigen",
        "Ici il faut dans la valeur de la commande action mettre": "Hier muss im Wert des Aktionsbefehls gesetzt werden",
        "(bien remplacer par votre propre commande) et lier l'état à la commande action (attention, il ne faut pas masquer la commande état cette fois)": "(durch Ihren eigenen Befehl ersetzen) und verknüpfen Sie den Status mit dem Aktionsbefehl (Vorsicht, diesmal sollten Sie den Statusbefehl nicht ausblenden)",
        "Il faut aussi passer la commande info en sous-type binaire": "Sie müssen den Befehl info auch im binären Subtyp platzieren",
        "Pour faire un calcul sur de multiples commandes, c'est très facile": "Es ist sehr einfach, eine Berechnung für mehrere Bestellungen durchzuführen",
        "Il suffit de créer une commande de type information virtuelle et dans le champs valeur mettre vos calculs": "Erstellen Sie einfach eine virtuelle Informationstypreihenfolge und geben Sie im Wertefeld Ihre Berechnungen ein",
        "Le testeur d'expression peut vous aider à cette étape pour valider": "Der Ausdruckstester kann Ihnen bei diesem Schritt bei der Validierung helfen",
        "Par exemple, pour faire la moyenne de 2 températures": "Zum Beispiel, um 2 Temperaturen zu mitteln",
        "Plusieurs points à réaliser correctement": "Einige Punkte müssen richtig gemacht werden",
        "Bien choisir le sous-type en fonction du type d'information (ici calcul de moyenne donc c'est un numérique)": "Wählen Sie den Subtyp entsprechend der Art der Informationen (hier gemittelt, also numerisch)",
        "Mettre des parenthèses dans les calculs, cela permet d'être sûr du résultat de l'opération": "Setzen Sie Klammern in die Berechnungen ein, damit Sie sicher sein können, dass das Ergebnis der Operation vorliegt",
        "Bien mettre l'unité": "Stellen Sie das Gerät gut auf",
        "Cocher la case pour historiser si nécessaire": "Aktivieren Sie das Kontrollkästchen, um bei Bedarf zu protokollieren",
        "Multiple commandes": "Mehrfachbestellungen",
        "Nous allons voir ici comment faire une commande qui va éteindre 2 lumières": "Wir werden hier sehen, wie man eine Bestellung aufgibt, die 2 Lichter ausschaltet",
        "Rien de plus simple, il suffit de créer une commande virtuelle et de mettre les 2 commandes séparées par un": "Nichts könnte einfacher sein, erstellen Sie einfach eine virtuelle Bestellung und setzen Sie die 2 Bestellungen getrennt durch a",
        "Ici, il faut bien que le sous-type de la commande soit le même que les sous-types des commandes pilotées, donc toutes les commandes dans le champs valeur doivent avoir le même sous-type (toutes \"autre\", ou toutes \"slider\", ou toutes de type couleur)": "Hier muss der Befehlssubtyp mit den gesteuerten Befehlssubtypen identisch sein, sodass alle Befehle im Wertefeld denselben Subtyp haben müssen (alle \"andere\" oder alle \"Schieberegler) \"oder alle Farben)",
        "Retour d'état virtuel": "Virtuelles Statusfeedback",
        "Lors de l'utilisation d'un équipement qui ne possède pas de retour d'état et si cet équipement est commandé seulement par Jeedom, il est possible d'avoir un retour d'état virtuel": "Bei Verwendung von Geräten ohne Statusrückmeldung und wenn dieses Gerät nur von Jeedom gesteuert wird, ist eine virtuelle Statusrückmeldung möglich",
        "Il faut pour cela créer un virtuel qui reprend les commandes actions (ex": "Dies erfordert das Erstellen einer virtuellen Datei, die die Aktionsbefehle ausführt (z",
        "On & Off) de l'équipement et qui possède une commande info (l'état)": "Ein & Aus) des Geräts und mit einem Info-Befehl (Status)",
        "Il faut ensuite renseigner la colonne Paramètre pour chaque commande action, en sélectionnant le nom de la commande info (état) et en donnant la valeur qu'elle doit prendre": "Anschließend müssen Sie die Spalte Parameter für jeden Aktionsbefehl ausfüllen, indem Sie den Namen des Infobefehls (Status) auswählen und den Wert angeben, den er annehmen muss",
        "On peut aussi imaginer un virtuel qui allume\/éteint plusieurs lampes (commandes actions séparées par des &&) et avoir ainsi un état de cette commande générale": "Wir können uns auch eine virtuelle vorstellen, die mehrere Lampen ein- und ausschaltet (durch && getrennte Aktionsbefehle) und somit den Status dieses allgemeinen Befehls hat",
        "Affectation d'une valeur par API": "Zuweisen eines Werts per API",
        "Il est possible de changer la valeur d'une information virtuelle par un": "Es ist möglich, den Wert virtueller Informationen durch a zu ändern",
        "appel API": "API-Aufruf",
        "Attention à bien rajouter un \/jeedom après \\": "Achten Sie darauf, nach \\ ein \/ jeedom hinzuzufügen",
        "si nécessaire": "falls erforderlich",
        " Configuration.": " Konfiguration.",
        " Configuration?": " Konfiguration?",
        "Configuration ": "Konfiguration ",
        "[Configuration": "[Konfiguration",
        "Configuration]": "Konfiguration]",
        "*Configuration": "*Konfiguration",
        "Configuration*": "Konfiguration*",
        " Tip.": " Spitze.",
        " Tip?": " Spitze?",
        "Tip ": "Spitze ",
        "[Tip": "[Spitze",
        "Tip]": "Spitze]",
        "*Tip": "*Spitze",
        "Tip*": "Spitze*",
        " Activer.": " Aktivieren.",
        " Activer?": " Aktivieren?",
        "Activer ": "Aktivieren ",
        "[Activer": "[Aktivieren",
        "Activer]": "Aktivieren]",
        "*Activer": "*Aktivieren",
        "Activer*": "Aktivieren*",
        " Visible.": " Sichtbar.",
        " Visible?": " Sichtbar?",
        "Visible ": "Sichtbar ",
        "[Visible": "[Sichtbar",
        "Visible]": "Sichtbar]",
        "*Visible": "*Sichtbar",
        "Visible*": "Sichtbar*",
        " Commentaire.": " Kommentar.",
        " Commentaire?": " Kommentar?",
        "Commentaire ": "Kommentar ",
        "[Commentaire": "[Kommentar",
        "Commentaire]": "Kommentar]",
        "*Commentaire": "*Kommentar",
        "Commentaire*": "Kommentar*",
        " Expression.": " Ausdruck.",
        " Expression?": " Ausdruck?",
        "Expression ": "Ausdruck ",
        "[Expression": "[Ausdruck",
        "Expression]": "Ausdruck]",
        "*Expression": "*Ausdruck",
        "Expression*": "Ausdruck*",
        " Dupliquer.": " Duplikat.",
        " Dupliquer?": " Duplikat?",
        "Dupliquer ": "Duplikat ",
        "[Dupliquer": "[Duplikat",
        "Dupliquer]": "Duplikat]",
        "*Dupliquer": "*Duplikat",
        "Dupliquer*": "Duplikat*",
        " Exemple.": " Beispiel.",
        " Exemple?": " Beispiel?",
        "Exemple ": "Beispiel ",
        "[Exemple": "[Beispiel",
        "Exemple]": "Beispiel]",
        "*Exemple": "*Beispiel",
        "Exemple*": "Beispiel*",
        " unité.": " Unit.",
        " unité?": " Unit?",
        "unité ": "Unit ",
        "[unité": "[Unit",
        "unité]": "Unit]",
        "*unité": "*Unit",
        "unité*": "Unit*",
        " historiser.": " Chronik.",
        " historiser?": " Chronik?",
        "historiser ": "Chronik ",
        "[historiser": "[Chronik",
        "historiser]": "Chronik]",
        "*historiser": "*Chronik",
        "historiser*": "Chronik*",
        " afficher.": " Anzeige.",
        " afficher?": " Anzeige?",
        "afficher ": "Anzeige ",
        "[afficher": "[Anzeige",
        "afficher]": "Anzeige]",
        "*afficher": "*Anzeige",
        "afficher*": "Anzeige*",
        " Tester.": " Test.",
        " Tester?": " Test?",
        "Tester ": "Test ",
        "[Tester": "[Test",
        "Tester]": "Test]",
        "*Tester": "*Test",
        "Tester*": "Test*",
        " Tutoriel.": " Tutorial.",
        " Tutoriel?": " Tutorial?",
        "Tutoriel ": "Tutorial ",
        "[Tutoriel": "[Tutorial",
        "Tutoriel]": "Tutorial]",
        "*Tutoriel": "*Tutorial",
        "Tutoriel*": "Tutorial*",
        " et.": " und.",
        " et?": " und?",
        "et ": "und ",
        "[et": "[und",
        "et]": "und]",
        "*et": "*und",
        "et*": "und*",
        " Note.": " Notiz.",
        " Note?": " Notiz?",
        "Note ": "Notiz ",
        "[Note": "[Notiz",
        "Note]": "Notiz]",
        "*Note": "*Notiz",
        "Note*": "Notiz*"
    }
}