{
    "changelog.md": {
        "23\/10\/2019": "23.10.2019",
        "Mise à jour de la doc": "Aktualisieren des Dokuments",
        "Supression forcé des \" lors d'un calcul sur une commande": "Erzwungenes Löschen von \"während einer Berechnung einer Bestellung",
        "Correction de bug de calcul si le résultat à pour valeur\"Faux": "Korrektur des Berechnungsfehlers, wenn das Ergebnis \"False\" ist",
        "10\/09\/2019": "09\/10\/2019",
        "Correction de l'arrondit forcé sur 2 chiffres sur les commandes numérique": "Korrektur der erzwungenen Rundung auf 2 Stellen bei digitalen Steuerungen",
        "Ajout d'un systeme de template pour créer des équipements rapidement": "Hinzufügen eines Vorlagensystems zum schnellen Erstellen von Geräten",
        "Correction de bugs": "Fehlerbehebungen",
        "26\/04\/2019": "26.04.2019",
        "22\/03\/2019": "22.03.2019",
        "Ajout d'une securité en cas de boucle infini": "Zusätzliche Sicherheit bei Endlosschleife",
        "18\/03\/2019": "18.03.2019",
        "13\/03\/2019": "13.03.2019",
        "22\/01\/2019": "22.01.2019",
        "21\/01\/2019": "21.01.2019",
        "Correction d'un bug sur les valeurs déclenchant une mise à jour d'une commande info": "Korrektur eines Fehlers bei den Werten, der eine Aktualisierung eines Infobefehls auslöst",
        "Correction de l'erreur lors de la copie d'un équipement si la commande Rafraichir existe": "Korrektur des Fehlers beim Kopieren eines Geräts, wenn der Befehl Aktualisieren vorhanden ist",
        "Ajout du testeur d'expressions": "Zugabe des Expressionstesters",
        " Optimisation.": " Optimierung.",
        " Optimisation?": " Optimierung?",
        "Optimisation ": "Optimierung ",
        "[Optimisation": "[Optimierung",
        "Optimisation]": "Optimierung]"
    },
    "index.md": {
        "Présentation": "Präsentation",
        "Le plugin Virtual (virtuel) permet la création de périphériques virtuels": "Das virtuelle Plugin ermöglicht die Erstellung virtueller Geräte",
        "et de leurs propriétés": "und ihre Eigenschaften",
        "Nous nommerons un périphérique créé par ce plugin": "Wir werden ein Gerät benennen, das von diesem Plugin erstellt wurde",
        "périphérique": "peripher",
        "Un périphérique virtuel peut être créé pour les besoins suivants": "Ein virtuelles Gerät kann für die folgenden Anforderungen erstellt werden",
        "consolider dans un seul périphérique des informations ou actions de": "Konsolidieren Sie Informationen oder Aktionen von einem einzigen Gerät",
        "plusieurs périphériques physiques\/virtuels ;": "mehrere physische \/ virtuelle Geräte;",
        "créer un périphérique alimenté par une source externe à Jeedom": "Erstellen Sie ein Gerät, das von einer Quelle außerhalb von Jeedom gespeist wird",
        "(Zibase, IPX800…) ;": "(Zibase, IPX800…);",
        "dupliquer un équipement pour le scinder en 2 par exemple ;": "doppelte Ausrüstung, um sie beispielsweise in zwei Teile zu teilen;",
        "effectuer un calcul sur plusieurs valeurs d'équipements ;": "eine Berechnung für mehrere Gerätewerte durchführen;",
        "exécuter de multiples actions (macro)": "mehrere Aktionen ausführen (Makro)",
        "Le plugin ne nécessite aucune configuration, il faut juste l'activer": "Das Plugin benötigt keine Konfiguration, Sie müssen es nur aktivieren",
        "Configuration des équipements": "Gerätekonfiguration",
        "La configuration des équipements virtuels est accessible à partir du": "Auf die Konfiguration der virtuellen Geräte kann über das zugegriffen werden",
        "menu plugin": "Plugin-Menü",
        "Voilà à quoi ressemble la page du plugin virtuel (ici avec déjà un": "So sieht die virtuelle Plugin-Seite aus (hier mit bereits einem",
        "Voilà à quoi ressemble la page de configuration d'un équipement virtuel": "So sieht die Konfigurationsseite eines virtuellen Geräts aus",
        "Comme à beaucoup d'endroits sur Jeedom, mettre la souris tout à gauche": "Setzen Sie die Maus wie an vielen Stellen auf Jeedom ganz links",
        "permet de faire apparaître un menu d'accès rapide (vous pouvez à": "ruft ein Schnellzugriffsmenü auf (Sie können",
        "partir de votre profil le laisser toujours visible)": "von deinem Profil immer sichtbar lassen)",
        "Vous retrouvez ici toute la configuration de votre équipement": "Hier finden Sie die gesamte Konfiguration Ihrer Geräte",
        "Nom de l'équipement virtuel": "Name des virtuellen Geräts",
        "nom de votre équipement virtuel": "Name Ihrer virtuellen Ausrüstung",
        "Objet parent": "Übergeordnetes Objekt",
        "indique l'objet parent auquel appartient": "gibt das übergeordnete Objekt an, zu dem es gehört",
        "l'équipement": "Ausrüstung",
        "Catégorie": "Kategorie",
        "les catégories de l'équipement (il peut appartenir à": "Gerätekategorien (es kann gehören",
        "plusieurs catégories)": "mehrere Kategorien)",
        "permet de rendre votre équipement actif": "macht Ihre Ausrüstung aktiv",
        "le rend visible sur le dashboard": "macht es auf dem Dashboard sichtbar",
        "vous permet de mettre des commentaires sur": "ermöglicht es Ihnen zu kommentieren",
        "En haut à droite vous avez accès à 4 boutons": "Oben rechts haben Sie Zugriff auf 4 Schaltflächen",
        "le testeur d'expressions identique à celui des scénarios": "Der Ausdruckstester ist identisch mit dem der Szenarien",
        "pour vous faciliter la mise au point de certains virtuels": "um die Entwicklung einiger virtueller zu erleichtern",
        "Importer équipement": "Ausrüstung importieren",
        "permet de dupliquer automatiquement un": "ermöglicht das automatische Duplizieren von a",
        "équipement existant dans un virtuel (permet de gagner du temps pour": "vorhandene Geräte in einer virtuellen (spart Zeit für",
        "scinder un équipement en 2 par exemple)": "Split Ausrüstung in 2 zum Beispiel)",
        "permet de dupliquer l'équipement courant": "dupliziert aktuelle Geräte",
        "Avancée (roues crantées)": "Fortgeschrittene (gekerbte Räder)",
        "permet d'afficher les options": "zeigt Optionen an",
        "avancées de l'équipement (commun à tous les plugins Jeedom)": "Gerätefortschritte (allen Jeedom-Plugins gemeinsam)",
        "En-dessous vous retrouvez la liste des commandes": "Nachfolgend finden Sie die Liste der Bestellungen",
        "le nom affiché sur le dashboard": "Der im Dashboard angezeigte Name",
        "le type et le sous-type": "Typ und Subtyp",
        "la valeur": "der Wert",
        "permet de donner la valeur de la commande en fonction": "ermöglicht es, den Wert der Bestellung entsprechend anzugeben",
        "d'une autre commande, d'une clef (quand on fait un interrupteur": "ein anderer Befehl, eine Taste (wenn Sie einen Wechsel vornehmen",
        "virtuel), d'un calcul, etc": "), eine Berechnung usw.",
        "Valeur de retour d'état\" et \"Durée avant retour d'état": "Statusrückmeldungswert \"und\" Dauer vor Statusrückmeldung",
        "d'indiquer à Jeedom qu'après un changement sur l'information sa": "Jeedom darauf hinzuweisen, dass nach einer Änderung der Informationen",
        "valeur doit revenir à Y, X min après le changement": "Der Wert muss nach der Änderung auf Y, X min zurückkehren",
        "le cas d'un détecteur de présence qui n'émet que lors d'une": "der Fall eines Anwesenheitsdetektors, der nur während a emittiert",
        "détection de présence, il est utile de mettre par exemple 0 en": "Anwesenheitserkennung ist es nützlich, zum Beispiel 0 zu setzen",
        "valeur et 4 en durée, pour que 4 mn après une détection de mouvement": "Wert und 4 in der Dauer, so dass 4 min nach Bewegungserkennung",
        "(et s'il n'y a en pas eu de nouvelle(s) depuis) Jeedom remette la": "(und wenn es seitdem keine Neuigkeiten mehr gibt) Jeedom setzt das zurück",
        "valeur de l'information à 0 (plus de mouvement détecté)": "Informationswert bei 0 (keine Bewegung mehr erkannt)",
        "unité de la donnée (peut être vide)": "Dateneinheit (kann leer sein)",
        "permet d'historiser la donnée": "ermöglicht das Historisieren der Daten",
        "permet d'afficher la donnée sur le dashboard": "ermöglicht die Anzeige der Daten im Dashboard",
        "événement": "Ereignis",
        "dans le cas du RFXcom cette case doit toujours être": "Bei RFXcom muss diese Box immer sein",
        "cochée car on ne peut pas interroger un module RFXcom": "aktiviert, da Sie kein RFXcom-Modul abfragen können",
        "min\/max": "min \/ max",
        "bornes de la donnée (peuvent être vides)": "Datengrenzen (können leer sein)",
        "configuration avancée (petites roues crantées)": "erweiterte Konfiguration (kleine gekerbte Räder)",
        "permet d'afficher": "Anzeigen",
        "la configuration avancée de la commande (méthode d'historisation": "Erweiterte Konfiguration des Befehls (Historisierungsmethode",
        "widget, etc.)": "Widget usw.)",
        "permet de tester la commande": "Wird zum Testen des Befehls verwendet",
        "supprimer (signe -)": "löschen (unterschreiben -)",
        "permet de supprimer la commande": "ermöglicht das Löschen des Befehls",
        "Interrupteur virtuel": "Virtueller Switch",
        "Pour faire un interrupteur virtuel, il vous faut ajouter 2 commandes": "Um einen virtuellen Switch durchzuführen, müssen Sie 2 Befehle hinzufügen",
        "virtuelles comme cela": "virtuell so",
        "Puis vous sauvegardez et là Jeedom va automatiquement ajouter la": "Dann speichern Sie und dort fügt Jeedom automatisch das hinzu",
        "commande d'information virtuelle": "virtuelle Informationsreihenfolge",
        "Ajoutez dans les commandes \"action\" `On` et `Off`, la commande `Etat`": "Fügen Sie in den \"Aktions\" -Befehlen \"Ein\" und \"Aus\" den Befehl \"Status\" hinzu",
        "(cela permet à Jeedom de faire le lien avec la commande état)": "(Dadurch kann Jeedom die Verknüpfung mit dem Statusbefehl herstellen.)",
        "Pour avoir un joli widget, il vous faut masquer la commande d'état": "Um ein schönes Widget zu haben, müssen Sie den Statusbefehl ausblenden",
        "Affectez un widget qui gère le retour d'état aux 2 commandes d'action": "Weisen Sie den beiden Aktionsbefehlen ein Widget zu, das die Statusrückmeldung verwaltet",
        "par exemple ici le widget light": "Zum Beispiel hier das Licht-Widget",
        "Pour ce faire cliquez sur la petite": "Klicken Sie dazu auf das kleine",
        "roue crantée en face de la commande `On` et dans le 2ème onglet": "Zahnrad vor dem Befehl \"Ein\" und in der 2. Registerkarte",
        "sélectionnez `light` comme widget": "Wählen Sie \"Licht\" als Widget",
        "Enregistrez et faites de même pour la commande `Off`": "Speichern Sie und machen Sie dasselbe für den Befehl \"Aus\"",
        "Et vous obtiendrez": "Und du wirst bekommen",
        "un joli widget qui changera d'état lors d'un clic": "Ein nettes Widget, das beim Klicken den Status ändert",
        "Slider virtuel": "Virtueller Schieberegler",
        "Pour faire un slider virtuel, il faut ajouter une commande virtuelle": "Fügen Sie einen virtuellen Befehl hinzu, um einen virtuellen Schieberegler zu erstellen",
        "comme cela": "so",
        "Comme tout à l'heure après la sauvegarde, Jeedom va automatiquement": "Wie zuvor nach dem Backup wird Jeedom automatisch",
        "créer la commande info": "Erstellen Sie den Befehl info",
        "Et comme tout à l'heure il est conseillé de lier l'action à la commande": "Und wie zuvor ist es ratsam, die Aktion mit dem Befehl zu verknüpfen",
        "d'état et de masquer celle-ci": "und verstecke es",
        "Interrupteur de type toggle": "Kippschalter",
        "Voilà comment faire un interrupteur de type toggle, pour cela il faut": "So machen Sie einen Kippschalter.",
        "créer une commande virtuelle de ce type": "Erstellen Sie eine solche virtuelle Bestellung",
        "Ensuite vous sauvegardez pour voir apparaître la commande d'état": "Anschließend speichern Sie, um den Statusbefehl anzuzeigen",
        "Ici il faut dans la valeur de la commande action mettre": "Hier muss im Wert des Aktionsbefehls gesetzt werden",
        "`not(\\#[...][...][Etat]#)` (bien remplacer par votre propre commande) et": "`not (\\# [...] [...] [State] #)` (durch eigenen Befehl ersetzen) und",
        "lier l'état à la commande action (attention, il ne faut pas masquer la": "Verknüpfen Sie den Status mit dem Aktionsbefehl (seien Sie vorsichtig, verstecken Sie den nicht",
        "commande état cette fois)": "diesmal Staatsbefehl)",
        "Il faut aussi passer la commande info en": "Sie müssen auch den Befehl info in platzieren",
        "sous-type binaire": "binärer Subtyp",
        "Pour faire un calcul sur de multiples commandes, c'est très facile": "Es ist sehr einfach, eine Berechnung für mehrere Bestellungen durchzuführen",
        "suffit de créer une commande de type information virtuelle et dans le": "Erstellen Sie einfach einen Befehl für den virtuellen Informationstyp und in der",
        "champs valeur mettre vos calculs": "Wertfelder setzen Ihre Berechnungen",
        "Le testeur d'expression peut vous aider": "Der Ausdruckstester kann Ihnen helfen",
        "à cette étape pour valider": "zu diesem Zeitpunkt zu validieren",
        "Par exemple, pour faire la moyenne de": "Zum Beispiel zu durchschnittlich",
        "2 températures": "2 Temperaturen",
        "Plusieurs points à réaliser correctement": "Einige Punkte müssen richtig gemacht werden",
        "Bien choisir le sous-type en fonction du type d'information (ici": "Wählen Sie den Subtyp entsprechend der Art der Informationen (hier",
        "calcul de moyenne donc c'est un numérique)": "Mittelwertbildung, also eine Zahl)",
        "Mettre des parenthèses dans les calculs, cela permet d'être sûr du": "Setzen Sie Klammern in die Berechnungen ein, damit Sie sicher sein können, dass",
        "résultat de l'opération": "Ergebnis der Operation",
        "Bien mettre l'unité": "Stellen Sie das Gerät gut auf",
        "Cocher la case pour historiser si nécessaire": "Aktivieren Sie das Kontrollkästchen, um bei Bedarf zu protokollieren",
        "Multiple commandes": "Mehrfachbestellungen",
        "Nous allons voir ici comment faire une commande qui va éteindre 2": "Wir werden hier sehen, wie Sie eine Bestellung aufgeben, die sich ausschaltet 2",
        "lumières. Rien de plus simple, il suffit de créer une commande virtuelle": "Lichter. Nichts ist einfacher, erstellen Sie einfach eine virtuelle Bestellung",
        "et de mettre les 2 commandes séparées par un `&&`": "und setzen Sie die 2 Befehle durch ein \"&&\" getrennt",
        "Ici, il faut bien que le sous-type de la commande soit le même que les": "Hier muss der Befehlssubtyp mit dem identisch sein",
        "sous-types des commandes pilotées, donc toutes les commandes dans le": "Untertypen der gesteuerten Befehle, daher alle Befehle in der",
        "champs valeur doivent avoir le même sous-type (toutes \"autre\", ou toutes": "Wertefelder müssen denselben Untertyp haben (alle \"anderen\" oder alle",
        "slider\", ou toutes de type couleur)": "Schieberegler \"oder alle Farbtypen)",
        "Retour d'état virtuel": "Virtuelles Statusfeedback",
        "Lors de l'utilisation d'un équipement qui ne possède pas de retour": "Bei Verwendung von Geräten ohne Rückgabe",
        "d'état et si cet équipement est commandé seulement par Jeedom, il est": "Status und wenn dieses Gerät nur von Jeedom bestellt wird, ist es",
        "possible d'avoir un retour d'état virtuel": "möglich, ein virtuelles Feedback zu haben",
        "Il faut pour cela créer un": "Dies erfordert das Erstellen eines",
        "virtuel qui reprend les commandes actions (ex": "virtuell, das Aktionsbefehle entgegennimmt (z",
        "On & Off) de l'équipement": "Ein & Aus) der Ausrüstung",
        "et qui possède une commande info (l'état)": "und wer hat einen Infobefehl (Status)",
        "Il faut ensuite renseigner la": "Dann müssen Sie die ausfüllen",
        "colonne Paramètre pour chaque commande action, en sélectionnant le nom": "Parameterspalte für jeden Aktionsbefehl durch Auswahl des Namens",
        "de la commande info (état) et en donnant la valeur qu'elle doit prendre": "des Info-Befehls (Status) und Angabe des Wertes, den er annehmen soll",
        "On peut aussi imaginer un virtuel qui allume\/éteint plusieurs lampes": "Wir können uns auch eine virtuelle vorstellen, die mehrere Lampen ein- und ausschaltet",
        "(commandes actions séparées par des &&) et avoir ainsi un état de cette": "(Aktionsbefehle durch && getrennt) und haben daher einen Status davon",
        "commande générale": "allgemeine Ordnung",
        "Affectation d'une valeur par API": "Zuweisen eines Werts per API",
        "Il est possible de changer la valeur d'une information virtuelle par un": "Es ist möglich, den Wert virtueller Informationen durch a zu ändern",
        "appel API": "API-Aufruf",
        "Attention à bien rajouter un \/jeedom après \\#IP\\_JEEDOM\\# si nécessaire": "Achten Sie darauf, bei Bedarf nach \/ #IP\\_JEEDOM \\# ein \/ jeedom hinzuzufügen",
        " virtuel.": " virtuell.",
        " virtuel?": " virtuell?",
        "virtuel ": "virtuell ",
        "[virtuel": "[virtuell",
        "virtuel]": "virtuell]",
        " Configuration.": " Konfiguration.",
        " Configuration?": " Konfiguration?",
        "Configuration ": "Konfiguration ",
        "[Configuration": "[Konfiguration",
        "Configuration]": "Konfiguration]",
        " équipement).": " Ausrüstung).",
        " équipement)?": " Ausrüstung)?",
        "équipement) ": "Ausrüstung) ",
        "[équipement)": "[Ausrüstung)",
        "équipement)]": "Ausrüstung)]",
        " Tip.": " Spitze.",
        " Tip?": " Spitze?",
        "Tip ": "Spitze ",
        "[Tip": "[Spitze",
        "Tip]": "Spitze]",
        " Activer.": " Aktivieren.",
        " Activer?": " Aktivieren?",
        "Activer ": "Aktivieren ",
        "[Activer": "[Aktivieren",
        "Activer]": "Aktivieren]",
        " Visible.": " Sichtbar.",
        " Visible?": " Sichtbar?",
        "Visible ": "Sichtbar ",
        "[Visible": "[Sichtbar",
        "Visible]": "Sichtbar]",
        " Commentaire.": " Kommentar.",
        " Commentaire?": " Kommentar?",
        "Commentaire ": "Kommentar ",
        "[Commentaire": "[Kommentar",
        "Commentaire]": "Kommentar]",
        " Expression.": " Ausdruck.",
        " Expression?": " Ausdruck?",
        "Expression ": "Ausdruck ",
        "[Expression": "[Ausdruck",
        "Expression]": "Ausdruck]",
        " Dupliquer.": " Duplikat.",
        " Dupliquer?": " Duplikat?",
        "Dupliquer ": "Duplikat ",
        "[Dupliquer": "[Duplikat",
        "Dupliquer]": "Duplikat]",
        " permet.": " erlaubt.",
        " permet?": " erlaubt?",
        "permet ": "erlaubt ",
        "[permet": "[erlaubt",
        "permet]": "erlaubt]",
        " Exemple.": " Beispiel.",
        " Exemple?": " Beispiel?",
        "Exemple ": "Beispiel ",
        "[Exemple": "[Beispiel",
        "Exemple]": "Beispiel]",
        " dans.": " IN.",
        " dans?": " IN?",
        "dans ": "IN ",
        "[dans": "[IN",
        "dans]": "IN]",
        " unité.": " Unit.",
        " unité?": " Unit?",
        "unité ": "Unit ",
        "[unité": "[Unit",
        "unité]": "Unit]",
        " historiser.": " Chronik.",
        " historiser?": " Chronik?",
        "historiser ": "Chronik ",
        "[historiser": "[Chronik",
        "historiser]": "Chronik]",
        " afficher.": " Anzeige.",
        " afficher?": " Anzeige?",
        "afficher ": "Anzeige ",
        "[afficher": "[Anzeige",
        "afficher]": "Anzeige]",
        " Tester.": " Test.",
        " Tester?": " Test?",
        "Tester ": "Test ",
        "[Tester": "[Test",
        "Tester]": "Test]",
        " Tutoriel.": " Tutorial.",
        " Tutoriel?": " Tutorial?",
        "Tutoriel ": "Tutorial ",
        "[Tutoriel": "[Tutorial",
        "Tutoriel]": "Tutorial]",
        " Calcul.": " Berechnung.",
        " Calcul?": " Berechnung?",
        "Calcul ": "Berechnung ",
        "[Calcul": "[Berechnung",
        "Calcul]": "Berechnung]",
        " Il.": " Er.",
        " Il?": " Er?",
        "Il ": "Er ",
        "[Il": "[Er",
        "Il]": "Er]",
        " Note.": " Notiz.",
        " Note?": " Notiz?",
        "Note ": "Notiz ",
        "[Note": "[Notiz",
        "Note]": "Notiz]"
    }
}