{
    "changelog.md": {
        "Changelog Virtuel": "Changelog Virtual",
        "Pour rappel s'il n'y a pas d'information sur la mise à jour, c'est que celle-ci concerne uniquement de la mise à jour de documentation, de traduction ou de texte": "As a reminder if there is no information on the update, it means that it only concerns the updating of documentation, translation or text",
        "23\/10\/2019": "10\/23\/2019",
        "Mise à jour de la doc": "Updating the doc",
        "Supression forcé des \" lors d'un calcul sur une commande": "Forced deletion of \"during a calculation on an order",
        "Correction de bug de calcul si le résultat à pour valeur\"Faux": "Correction of calculation bug if the result is \"False\"",
        "10\/09\/2019": "09\/10\/2019",
        "Correction de l'arrondit forcé sur 2 chiffres sur les commandes numérique": "Correction of forced rounding to 2 digits on digital controls",
        "Ajout d'un systeme de template pour créer des équipements rapidement": "Adding a template system to quickly create equipment",
        "Correction de bugs": "Bugfix",
        "26\/04\/2019": "04\/26\/2019",
        "22\/03\/2019": "03\/22\/2019",
        "Ajout d'une securité en cas de boucle infini": "Addition of security in case of infinite loop",
        "18\/03\/2019": "03\/18\/2019",
        "13\/03\/2019": "03\/13\/2019",
        "22\/01\/2019": "01\/22\/2019",
        "21\/01\/2019": "01\/21\/2019",
        "Correction d'un bug sur les valeurs déclenchant une mise à jour d'une commande info": "Correction of a bug on the values triggering an update of an info command",
        "Correction de l'erreur lors de la copie d'un équipement si la commande Rafraichir existe": "Correction of the error when copying a device if the Refresh command exists",
        "Ajout du testeur d'expressions": "Addition of the expression tester",
        " IMPORTANT.": " Important.",
        " IMPORTANT?": " Important?",
        "IMPORTANT ": "Important ",
        "[IMPORTANT": "[Important",
        "IMPORTANT]": "Important]",
        "*IMPORTANT": "*Important",
        "IMPORTANT*": "Important*",
        " Optimisation.": " Optimization.",
        " Optimisation?": " Optimization?",
        "Optimisation ": "Optimization ",
        "[Optimisation": "[Optimization",
        "Optimisation]": "Optimization]",
        "*Optimisation": "*Optimization",
        "Optimisation*": "Optimization*"
    },
    "index.md": {
        "Plugin Virtuel": "Virtual plugin",
        "Le plugin Virtual (virtuel) permet la création de périphériques virtuels et de leurs propriétés": "The Virtual plugin allows the creation of virtual devices and their properties",
        "Nous nommerons un périphérique créé par ce plugin": "We will name a device created by this plugin",
        "périphérique virtuel": "virtual device",
        "Un périphérique virtuel peut être créé pour les besoins suivants": "A virtual device can be created for the following needs",
        "consolider dans un seul périphérique des informations ou actions de plusieurs périphériques physiques\/virtuels ;": "consolidate information or actions from several physical \/ virtual devices into a single device;",
        "créer un périphérique alimenté par une source externe à Jeedom (Zibase, IPX800…) ;": "create a peripheral powered by a source external to Jeedom (Zibase, IPX800, etc.);",
        "dupliquer un équipement pour le scinder en 2 par exemple ;": "duplicate equipment to split it into 2, for example;",
        "effectuer un calcul sur plusieurs valeurs d'équipements ;": "perform a calculation on several equipment values;",
        "exécuter de multiples actions (macro)": "execute multiple actions (macro)",
        "Le plugin ne nécessite aucune configuration, il faut juste l'activer": "The plugin does not require any configuration, you just have to activate it",
        "Configuration des équipements": "Equipment configuration",
        "La configuration des équipements virtuels est accessible à partir du menu plugin": "The configuration of virtual devices is accessible from the plugin menu",
        "Voilà à quoi ressemble la page du plugin virtuel (ici avec déjà un équipement)": "This is what the virtual plugin page looks like (here with already an equipment)",
        "Voilà à quoi ressemble la page de configuration d'un équipement virtuel": "This is what the configuration page of a virtual device looks like",
        "Comme à beaucoup d'endroits sur Jeedom, mettre la souris tout à gauche permet de faire apparaître un menu d'accès rapide (vous pouvez à partir de votre profil le laisser toujours visible)": "As in many places on Jeedom, putting the mouse on the far left allows a quick access menu to appear (you can always leave it visible from your profile)",
        "Vous retrouvez ici toute la configuration de votre équipement": "Here you find all the configuration of your equipment",
        "Nom de l'équipement virtuel": "Name of the virtual device",
        "nom de votre équipement virtuel": "name of your virtual equipment",
        "Objet parent": "Parent object",
        "indique l'objet parent auquel appartient l'équipement": "indicates the parent object to which the equipment belongs",
        "Catégorie": "Category",
        "les catégories de l'équipement (il peut appartenir à plusieurs catégories)": "equipment categories (it can belong to several categories)",
        "permet de rendre votre équipement actif": "makes your equipment active",
        "le rend visible sur le dashboard": "makes it visible on the dashboard",
        "vous permet de mettre des commentaires sur l'équipement": "allows you to comment on equipment",
        "En haut à droite vous avez accès à 4 boutons": "At the top right you have access to 4 buttons",
        "le testeur d'expressions identique à celui des scénarios pour vous faciliter la mise au point de certains virtuels": "the expression tester identical to that of the scenarios to facilitate the development of some virtual",
        "Importer équipement": "Import equipment",
        "permet de dupliquer automatiquement un équipement existant dans un virtuel (permet de gagner du temps pour scinder un équipement en 2 par exemple)": "allows to automatically duplicate an existing equipment in a virtual one (saves time to split an equipment in 2 for example)",
        "permet de dupliquer l'équipement courant": "duplicates current equipment",
        "Avancée (roues crantées)": "Advanced (notched wheels)",
        "permet d'afficher les options avancées de l'équipement (commun à tous les plugins Jeedom)": "displays advanced equipment options (common to all Jeedom plugins)",
        "En-dessous vous retrouvez la liste des commandes": "Below you find the list of orders",
        "le nom affiché sur le dashboard": "the name displayed on the dashboard",
        "le type et le sous-type": "type and subtype",
        "la valeur": "the value",
        "permet de donner la valeur de la commande en fonction d'une autre commande, d'une clef (quand on fait un interrupteur virtuel), d'un calcul, etc": "allows to give the value of the command according to another command, a key (when we make a virtual switch), a calculation, etc",
        "Valeur de retour d'état\" et \"Durée avant retour d'état": "Status feedback value \"and\" Duration before status feedback",
        "permet d'indiquer à Jeedom qu'après un changement sur l'information sa valeur doit revenir à Y, X min après le changement": "allows to indicate to Jeedom that after a change on the information its value must return to Y, X min after the change",
        "dans le cas d'un détecteur de présence qui n'émet que lors d'une détection de présence, il est utile de mettre par exemple 0 en valeur et 4 en durée, pour que 4 mn après une détection de mouvement (et s'il n'y a en pas eu de nouvelle(s) depuis) Jeedom remette la valeur de l'information à 0 (plus de mouvement détecté)": "in the case of a presence detector which emits only during a presence detection, it is useful to set for example 0 in value and 4 in duration, so that 4 minutes after a detection of movement (and s' there has been no news since) Jeedom resets the value of the information to 0 (more movement detected)",
        "unité de la donnée (peut être vide)": "data unit (can be empty)",
        "permet d'historiser la donnée": "allows to historize the data",
        "permet d'afficher la donnée sur le dashboard": "allows to display the data on the dashboard",
        "événement": "Event",
        "dans le cas du RFXcom cette case doit toujours être cochée car on ne peut pas interroger un module RFXcom": "in the case of RFXcom this box must always be checked because you cannot interrogate an RFXcom module",
        "min\/max": "min \/ max",
        "bornes de la donnée (peuvent être vides)": "data bounds (may be empty)",
        "configuration avancée (petites roues crantées)": "advanced configuration (small notched wheels)",
        "permet d'afficher la configuration avancée de la commande (méthode d'historisation, widget, etc.)": "displays the advanced configuration of the command (logging method, widget, etc.)",
        "permet de tester la commande": "Used to test the command",
        "supprimer (signe -)": "delete (sign -)",
        "permet de supprimer la commande": "allows to delete the command",
        "Interrupteur virtuel": "Virtual switch",
        "Pour faire un interrupteur virtuel, il vous faut ajouter 2 commandes virtuelles comme cela": "To make a virtual switch, you need to add 2 virtual commands like this",
        "Puis vous sauvegardez et là Jeedom va automatiquement ajouter la commande d'information virtuelle": "Then you save and there Jeedom will automatically add the virtual information command",
        "Ajoutez dans les commandes \"action": "Add in the orders \"action",
        "la commande": "The command",
        "(cela permet à Jeedom de faire le lien avec la commande état)": "(this allows Jeedom to make the link with the state command)",
        "Pour avoir un joli widget, il vous faut masquer la commande d'état": "To have a nice widget, you need to hide the status command",
        "Affectez un widget qui gère le retour d'état aux 2 commandes d'action, par exemple ici le widget light": "Assign a widget that manages the status feedback to the 2 action commands, for example here the light widget",
        "Pour ce faire cliquez sur la petite roue crantée en face de la commande": "To do this click on the small notched wheel in front of the control",
        "et dans le 2ème onglet sélectionnez": "and in the 2nd tab select",
        "comme widget": "as widget",
        "Enregistrez et faites de même pour la commande": "Save and do the same for the order",
        "Et vous obtiendrez un joli widget qui changera d'état lors d'un clic": "And you will get a nice widget that will change state when clicked",
        "Slider virtuel": "Virtual slider",
        "Pour faire un slider virtuel, il faut ajouter une commande virtuelle comme cela": "To make a virtual slider, add a virtual command like this",
        "Comme tout à l'heure après la sauvegarde, Jeedom va automatiquement créer la commande info": "As before after the backup, Jeedom will automatically create the info command",
        "Et comme tout à l'heure il est conseillé de lier l'action à la commande d'état et de masquer celle-ci": "And as before, it is advisable to link the action to the status command and to hide it",
        "Interrupteur de type toggle": "Toggle switch",
        "Voilà comment faire un interrupteur de type toggle, pour cela il faut créer une commande virtuelle de ce type": "This is how to make a switch of type toggle, for that you have to create a virtual command of this type",
        "Ensuite vous sauvegardez pour voir apparaître la commande d'état": "Then you save to see the status command appear",
        "Ici il faut dans la valeur de la commande action mettre": "Here it is necessary in the value of the action command to put",
        "(bien remplacer par votre propre commande) et lier l'état à la commande action (attention, il ne faut pas masquer la commande état cette fois)": "(replace with your own command) and link the state to the action command (be careful, you should not hide the state command this time)",
        "Il faut aussi passer la commande info en sous-type binaire": "You must also place the info command in binary subtype",
        "Pour faire un calcul sur de multiples commandes, c'est très facile": "To do a calculation on multiple orders, it's very easy",
        "Il suffit de créer une commande de type information virtuelle et dans le champs valeur mettre vos calculs": "Just create a virtual information type order and in the value field put your calculations",
        "Le testeur d'expression peut vous aider à cette étape pour valider": "The expression tester can help you with this step to validate",
        "Par exemple, pour faire la moyenne de 2 températures": "For example, to average 2 temperatures",
        "Plusieurs points à réaliser correctement": "Several points to be done correctly",
        "Bien choisir le sous-type en fonction du type d'information (ici calcul de moyenne donc c'est un numérique)": "Choose the subtype according to the type of information (here averaging so it's a numeric)",
        "Mettre des parenthèses dans les calculs, cela permet d'être sûr du résultat de l'opération": "Put parentheses in the calculations, this allows you to be sure of the result of the operation",
        "Bien mettre l'unité": "Put the unit well",
        "Cocher la case pour historiser si nécessaire": "Check the box to log if necessary",
        "Multiple commandes": "Multiple orders",
        "Nous allons voir ici comment faire une commande qui va éteindre 2 lumières": "We will see here how to make an order which will turn off 2 lights",
        "Rien de plus simple, il suffit de créer une commande virtuelle et de mettre les 2 commandes séparées par un": "Nothing could be simpler, just create a virtual order and put the 2 orders separated by a",
        "Ici, il faut bien que le sous-type de la commande soit le même que les sous-types des commandes pilotées, donc toutes les commandes dans le champs valeur doivent avoir le même sous-type (toutes \"autre\", ou toutes \"slider\", ou toutes de type couleur)": "Here, the command subtype must be the same as the controlled command subtypes, so all commands in the value field must have the same subtype (all \"other\", or all \"slider \", or all color)",
        "Retour d'état virtuel": "Virtual status feedback",
        "Lors de l'utilisation d'un équipement qui ne possède pas de retour d'état et si cet équipement est commandé seulement par Jeedom, il est possible d'avoir un retour d'état virtuel": "When using equipment which does not have a status feedback and if this equipment is controlled only by Jeedom, it is possible to have a virtual status feedback",
        "Il faut pour cela créer un virtuel qui reprend les commandes actions (ex": "This requires creating a virtual that takes the actions commands (ex",
        "On & Off) de l'équipement et qui possède une commande info (l'état)": "On & Off) of the equipment and which has an info command (the status)",
        "Il faut ensuite renseigner la colonne Paramètre pour chaque commande action, en sélectionnant le nom de la commande info (état) et en donnant la valeur qu'elle doit prendre": "You must then complete the Parameter column for each action command, by selecting the name of the info command (status) and giving the value it must take",
        "On peut aussi imaginer un virtuel qui allume\/éteint plusieurs lampes (commandes actions séparées par des &&) et avoir ainsi un état de cette commande générale": "We can also imagine a virtual one that turns on \/ off several lamps (actions commands separated by &&) and thus have a status of this general command",
        "Affectation d'une valeur par API": "Assigning a value by API",
        "Il est possible de changer la valeur d'une information virtuelle par un": "It is possible to change the value of virtual information by a",
        "appel API": "API call",
        "Attention à bien rajouter un \/jeedom après \\": "Be careful to add a \/ jeedom after \\",
        "si nécessaire": "if necessary",
        " Configuration.": " Setup.",
        " Configuration?": " Setup?",
        "Configuration ": "Setup ",
        "[Configuration": "[Setup",
        "Configuration]": "Setup]",
        "*Configuration": "*Setup",
        "Configuration*": "Setup*",
        " Tip.": " Tip.",
        " Tip?": " Tip?",
        "Tip ": "Tip ",
        "[Tip": "[Tip",
        "Tip]": "Tip]",
        "*Tip": "*Tip",
        "Tip*": "Tip*",
        " Activer.": " Activate.",
        " Activer?": " Activate?",
        "Activer ": "Activate ",
        "[Activer": "[Activate",
        "Activer]": "Activate]",
        "*Activer": "*Activate",
        "Activer*": "Activate*",
        " Visible.": " Visible.",
        " Visible?": " Visible?",
        "Visible ": "Visible ",
        "[Visible": "[Visible",
        "Visible]": "Visible]",
        "*Visible": "*Visible",
        "Visible*": "Visible*",
        " Commentaire.": " Comment.",
        " Commentaire?": " Comment?",
        "Commentaire ": "Comment ",
        "[Commentaire": "[Comment",
        "Commentaire]": "Comment]",
        "*Commentaire": "*Comment",
        "Commentaire*": "Comment*",
        " Expression.": " Expression.",
        " Expression?": " Expression?",
        "Expression ": "Expression ",
        "[Expression": "[Expression",
        "Expression]": "Expression]",
        "*Expression": "*Expression",
        "Expression*": "Expression*",
        " Dupliquer.": " Duplicate.",
        " Dupliquer?": " Duplicate?",
        "Dupliquer ": "Duplicate ",
        "[Dupliquer": "[Duplicate",
        "Dupliquer]": "Duplicate]",
        "*Dupliquer": "*Duplicate",
        "Dupliquer*": "Duplicate*",
        " Exemple.": " Example.",
        " Exemple?": " Example?",
        "Exemple ": "Example ",
        "[Exemple": "[Example",
        "Exemple]": "Example]",
        "*Exemple": "*Example",
        "Exemple*": "Example*",
        " unité.": " Unit.",
        " unité?": " Unit?",
        "unité ": "Unit ",
        "[unité": "[Unit",
        "unité]": "Unit]",
        "*unité": "*Unit",
        "unité*": "Unit*",
        " historiser.": " Historize.",
        " historiser?": " Historize?",
        "historiser ": "Historize ",
        "[historiser": "[Historize",
        "historiser]": "Historize]",
        "*historiser": "*Historize",
        "historiser*": "Historize*",
        " afficher.": " Pin up.",
        " afficher?": " Pin up?",
        "afficher ": "Pin up ",
        "[afficher": "[Pin up",
        "afficher]": "Pin up]",
        "*afficher": "*Pin up",
        "afficher*": "Pin up*",
        " Tester.": " Test.",
        " Tester?": " Test?",
        "Tester ": "Test ",
        "[Tester": "[Test",
        "Tester]": "Test]",
        "*Tester": "*Test",
        "Tester*": "Test*",
        " Tutoriel.": " Tutorial.",
        " Tutoriel?": " Tutorial?",
        "Tutoriel ": "Tutorial ",
        "[Tutoriel": "[Tutorial",
        "Tutoriel]": "Tutorial]",
        "*Tutoriel": "*Tutorial",
        "Tutoriel*": "Tutorial*",
        " et.": " and.",
        " et?": " and?",
        "et ": "and ",
        "[et": "[and",
        "et]": "and]",
        "*et": "*and",
        "et*": "and*",
        " Note.": " NOTE.",
        " Note?": " NOTE?",
        "Note ": "NOTE ",
        "[Note": "[NOTE",
        "Note]": "NOTE]",
        "*Note": "*NOTE",
        "Note*": "NOTE*"
    }
}