{
    "changelog.md": {
        "Changelog Virtuel": "Changelog Virtual",
        "S'il n'y a pas d'information sur la mise à jour, c'est que celle-ci concerne uniquement de la mise à jour de documentation, de traduction ou de texte": "If there is no information on the update, it means that it concerns only the update of documentation, translation or text",
        "17\/10\/2022": "10\/17\/2022",
        "Mise à jour liste des commandes pour Jeedom v4.3": "Update command list for Jeedom v4.3",
        "24\/01\/2022": "01\/24\/2022",
        "Optimisations V4.2": "V4.2 optimizations",
        "11\/11\/2021": "11\/11\/2021",
        "mise à jour interface et documentation": "interface and documentation update",
        "02\/08\/2021": "08\/02\/2021",
        "Correction de bugs": "Bugfix",
        "16\/05\/2020": "05\/16\/2020",
        "Correction d'un souci de remontée en double des commandes de type information": "Correction of a problem with duplicate reporting of information type commands",
        "23\/10\/2019": "10\/23\/2019",
        "Mise à jour de la documentation": "Documentation update",
        "Supression forcée des guillemets lors d'un calcul sur une commande": "Forced deletion of quotes during a calculation on a command",
        "Correction d'un bug de calcul si le résultat a pour valeur \"Faux": "Correction of a calculation bug if the result has the value \"False",
        "10\/09\/2019": "09\/10\/2019",
        "Correction de l'arrondi forcé sur 2 chiffres sur les commandes numériques": "Correction of forced rounding on 2 digits on digital controls",
        "Ajout d'un système de templates pour créer des équipements rapidement": "Addition of a template system to create equipment quickly",
        "26\/04\/2019": "04\/26\/2019",
        "22\/03\/2019": "03\/22\/2019",
        "Ajout d'une securité en cas de boucle infinie": "Added security in case of infinite loop",
        "18\/03\/2019": "03\/18\/2019",
        "13\/03\/2019": "03\/13\/2019",
        "22\/01\/2019": "01\/22\/2019",
        "21\/01\/2019": "01\/21\/2019",
        "Correction d'un bug sur les valeurs déclenchant la mise à jour d'une commande info": "Correction of a bug on the values triggering the update of an info command",
        "Correction de l'erreur lors de la copie d'un équipement si la commande Rafraichir existe": "Correction of the error when copying a device if the Refresh command exists",
        "Ajout du testeur d'expressions": "Addition of the expression tester",
        " IMPORTANT.": " Important.",
        " IMPORTANT?": " Important?",
        "IMPORTANT ": "Important ",
        " IMPORTANT]": " Important]",
        "[IMPORTANT]": "[Important]",
        "*IMPORTANT*": "*Important*",
        " IMPORTANT*": " Important*",
        " Optimisation.": " Optimization.",
        " Optimisation?": " Optimization?",
        "Optimisation ": "Optimization ",
        " Optimisation]": " Optimization]",
        "[Optimisation]": "[Optimization]",
        "*Optimisation*": "*Optimization*",
        " Optimisation*": " Optimization*"
    },
    "index.md": {
        "Plugin Virtuel": "Virtual plugin",
        "Le plugin": "The plugin",
        "permet la création d'équipements virtuels et de commandes virtuelles": "allows the creation of virtual equipment and virtual controls",
        "équipement virtuel": "virtual equipment",
        "Dans cette documentation, nous nommerons un équipement créé par ce plugin comme étant un": "In this documentation, we will name a device created by this plugin as a",
        "Un équipement virtuel peut être utile pour les besoins suivants": "Virtual equipment can be useful for the following needs",
        "consolider dans un seul équipement les informations et\/ou les actions de plusieurs équipements physiques\/virtuels": "consolidate in a single device the information and \/ or actions of several physical \/ virtual devices",
        "Zibase, IPX800, etc…": "Zibase, IPX800, etc",
        "créer un équipement alimenté par une source externe à Jeedom": "create equipment powered by a source external to Jeedom",
        "dupliquer un équipement pour le scinder en 2 par exemple": "duplicate equipment to split it into 2 for example",
        "effectuer un calcul sur plusieurs valeurs d'équipements": "perform a calculation on several equipment values",
        "exécuter de multiples actions": "perform multiple actions",
        "cpu\/mémoire\/swap\/disque": "cpu \/ memory \/ swap \/ disk",
        "Il ne faut pas abuser des virtuels car ils entrainent une surconsommation générale": "Virtuals should not be abused because they lead to general overconsumption",
        "des temps de latence plus longs, une usure de la carte SD, etc... Il ne faut donc EN AUCUN CAS dupliquer (tous) les équipements en virtuel sans absolue nécessité": "longer latency times, wear of the SD card, etc",
        "Les virtuels sont des outils à utiliser avec parcimonie uniquement lorsque cela s'avère nécessaire": "Virtuals are tools to be used sparingly only when necessary",
        "Configuration du plugin": "Plugin configuration",
        "Ce plugin ne nécessite pas de configuration particulière et doit simplement être activé après l'installation": "This plugin does not require any special configuration and must simply be activated after installation",
        "Configuration des équipements": "Equipment configuration",
        "Plugins → Programmation → Virtuel": "Plugins → Programming → Virtual",
        "Les équipements virtuels sont accessibles à partir du menu": "Virtual devices are accessible from the menu",
        "Cliquez sur un équipement virtuel pour accéder à sa page de configuration": "Click on a virtual device to access its configuration page",
        "Nom du virtuel": "Virtual name",
        "nom de votre équipement virtuel": "name of your virtual equipment",
        "Objet parent": "Parent object",
        "indique l'objet parent auquel appartient l'équipement": "indicates the parent object to which the equipment belongs",
        "Catégorie": "Category",
        "il peut appartenir à plusieurs catégories": "it can belong to several categories",
        "les catégories de l'équipement": "equipment categories",
        "permet de rendre l'équipement actif": "allows to make the equipment active",
        "permet de rendre l'équipement visible sur le dashboard": "allows to make the equipment visible on the dashboard",
        "par cron - un assistant est disponible en cliquant sur le point d'interrogation en bout de ligne": "by cron - a wizard is available by clicking on the question mark at the end of the line",
        "Fréquence de mise à jour des commandes info": "Info commands update frequency",
        "URL de retour": "Return url",
        "il est possible de changer la valeur d'une information virtuelle par API": "it is possible to change the value of a virtual information by API",
        "Description du virtuel": "Virtual description",
        "vous permet de décrire l'équipement virtuel": "allows you to describe the virtual equipment",
        "Concernant l": "Concerning I",
        "veillez à bien ajouter": "be sure to add",
        "après": "after",
        "si nécessaire": "if necessary",
        "En haut à droite vous avez accès à 3 boutons en complément de ceux communs à tous les plugins": "At the top right you have access to 3 buttons in addition to those common to all plugins",
        "ouvre le testeur d'expressions afin de faciliter la mise en place de certains virtuels": "opens the expression tester to facilitate the implementation of certain virtual ones",
        "permet de créer un équipement virtuel très rapidement par la sélection d'un template": "allows you to create a virtual device very quickly by selecting a template",
        "Importer équipement": "Import equipment",
        "pour gagner du temps afin de scinder un équipement en 2 par exemple": "to save time in order to split a piece of equipment into 2 for example",
        "permet de dupliquer automatiquement un équipement existant en équipement virtuel": "Automatically duplicates existing equipment as virtual equipment",
        "En cliquant sur l'onglet": "By clicking on the tab",
        "vous retrouvez la liste des commandes virtuelles": "you will find the list of virtual controls",
        "le numéro d'identification de la commande": "the order identification number",
        "Nom de la commande": "Order name",
        "le nom affiché sur le dashboard": "the name displayed on the dashboard",
        "Icône": "Icon",
        "le cas échéant, l'icône représentative de la commande": "if applicable, the icon representing the order",
        "Commande info liée": "Related info command",
        "permet de renseigner la commande info d'état liée à la commande action": "used to enter the status info command linked to the action command",
        "le type et le sous-type": "type and subtype",
        "quand on fait un interrupteur virtuel": "when we make a virtual switch",
        "permet de donner la valeur de la commande en fonction d'une autre commande, d'une clef": "allows to give the value of the command according to another command, a key",
        "d'un calcul, etc": "a calculation, etc",
        "Paramètres": "Settings",
        "Valeur de retour d'état": "Status return value",
        "Durée avant retour d'état": "Duration before status return",
        "s'il n'y en a pas eu d'autres détections depuis": "if there have been no other detections since",
        "&": "&",
        "permet d'indiquer que la valeur doit revenir à": "allows you to indicate that the value must return to",
        "après un changement": "after a change",
        "Par exemple, dans le cas d'un détecteur de mouvement qui n'émet que lors d'une détection, il est utile de mettre": "For example, in the case of a motion detector which emits only upon detection, it is useful to put",
        "en valeur et": "in value and",
        "en durée pour que 4 minutes après une détection de mouvement la valeur de la commande revienne à": "in duration so that 4 minutes after a movement detection the value of the command reverts to",
        "Info à mettre à jour": "Info to update",
        "valeur de l'info": "info value",
        "permet d'indiquer une commande info à mettre à jour lors de l'exécution de la commande et la valeur à lui attribuer": "allows you to indicate an info command to update during the execution of the command and the value to assign to it",
        "permet d'afficher la commande sur le dashboard": "allows you to display the order on the dashboard",
        "permet d'historiser la commande": "allows to log the order",
        "info\/binaire uniquement": "info \/ binary only",
        "permet d'inverser la valeur de la commande": "allows to invert the value of the command",
        "Min\/Max": "Min \/ max",
        "peuvent être vides - min": "may be empty - min",
        "100 par défaut": "100 by default",
        "bornes des valeurs de la commande": "command value limits",
        "peut être vide": "can be empty",
        "unité de la valeur de la commande": "order value unit",
        "Liste de valeurs": "List of values",
        "action\/liste uniquement": "action \/ list only",
        "Liste de": "List of",
        "séparées par un": "separated by a",
        "Configuration avancée": "Advanced configuration",
        "roues crantées": "toothed wheels",
        "méthode d'historisation, widget, etc": "historization method, widget, etc",
        "permet d'afficher la configuration avancée de la commande": "used to display the advanced configuration of the command",
        "permet de tester la commande": "Used to test the command",
        "permet de supprimer la commande": "allows to delete the command",
        "Chaque équipement virtuel possède une commande": "Each virtual device has a command",
        "qui permet de forcer la mise à jour de toutes les commandes info": "which allows to force the update of all info commands",
        "Exemples de virtuels": "Virtual examples",
        "Interrupteur virtuel": "Virtual switch",
        "Pour faire un interrupteur virtuel, il faut ajouter 2 actions virtuelles comme cela": "To make a virtual switch, you have to add 2 virtual actions like this",
        "Puis vous sauvegardez et là Jeedom va automatiquement ajouter la commande d'information virtuelle": "Then you save and there Jeedom will automatically add the virtual information command",
        "Ajoutez dans les commandes \"action": "Add in the orders \"action",
        "la commande": "The command",
        "cela permet à Jeedom de faire le lien avec la commande état": "this allows Jeedom to make the link with the state command",
        "Pour avoir un joli widget, il faut masquer la commande d'état": "To have a nice widget, you have to hide the status command",
        "Affectez un widget qui gère le retour d'état aux 2 commandes d'action, par exemple ici le widget light": "Assign a widget that manages the status feedback to the 2 action commands, for example here the light widget",
        "Pour ce faire cliquez sur la petite roue crantée en face de la commande": "To do this click on the small notched wheel in front of the control",
        "et dans le 2ème onglet sélectionnez": "and in the 2nd tab select",
        "comme widget": "as widget",
        "Enregistrez et faites de même pour la commande": "Save and do the same for the order",
        "Et vous obtiendrez un joli widget qui changera d'état lors d'un clic": "And you will get a nice widget that will change state when clicked",
        "Slider virtuel": "Virtual slider",
        "Pour faire un slider virtuel, il faut ajouter une action virtuelle comme cela": "To make a virtual slider, you have to add a virtual action like this",
        "Comme tout à l'heure après la sauvegarde, Jeedom va automatiquement créer la commande info": "As before after the backup, Jeedom will automatically create the info command",
        "Et comme tout à l'heure il est conseillé de lier l'action à la commande d'état et de masquer celle-ci": "And as before, it is advisable to link the action to the status command and to hide it",
        "Interrupteur de type toggle": "Toggle switch",
        "Voilà comment faire un interrupteur de type toggle (ou bouton poussoir), pour cela il faut créer une action virtuelle de ce type": "This is how to make a toggle type switch (or push button), for this you have to create a virtual action of this type",
        "Ensuite vous sauvegardez pour voir apparaître la commande d'état": "Then you save to see the status command appear",
        "remplacer par votre propre commande": "replace with your own order",
        "Ici il faut dans la valeur de la commande action mettre": "Here it is necessary in the value of the action command to put",
        "et lier l'état à la commande action (attention, il ne faut pas masquer la commande état cette fois": "and link the state to the action command (be careful, you must not hide the state command this time",
        "Il faut aussi passer la commande info en sous-type binaire": "You must also place the info command in binary subtype",
        "Multiple commandes": "Multiple orders",
        "Pour faire un calcul sur de multiples commandes, c'est très facile": "To do a calculation on multiple orders, it's very easy",
        "Il suffit de créer une commande de type information virtuelle et dans le champs valeur mettre vos calculs": "Just create a virtual information type order and in the value field put your calculations",
        "Le testeur d'expression peut vous aider à cette étape pour valider": "The expression tester can help you with this step to validate",
        "Par exemple, pour faire la moyenne de 2 températures": "For example, to average 2 temperatures",
        "Plusieurs points à réaliser correctement": "Several points to be done correctly",
        "Bien choisir le sous-type en fonction du type d'information (ici calcul de moyenne donc c'est un numérique": "Choose the subtype according to the type of information (here calculation of average so it is a numeric",
        "Mettre des parenthèses dans les calculs, cela permet d'être sûr du résultat de l'opération": "Put parentheses in the calculations, this allows you to be sure of the result of the operation",
        "Bien mettre l'unité": "Put the unit well",
        "Cocher la case pour historiser si nécessaire": "Check the box to log if necessary",
        "Nous allons voir ici comment faire une commande qui va éteindre 2 lumières": "We will see here how to make an order which will turn off 2 lights",
        "Rien de plus simple, il suffit de créer une action virtuelle et de mettre les 2 commandes séparées par un": "Nothing could be simpler, just create a virtual action and put the 2 commands separated by a",
        "toutes \"autre\" ou toutes \"slider\" ou toutes de type \"couleur\", etc": "all \"other\" or all \"slider\" or all of type \"color\", etc",
        "Il est impératif que le sous-type de la commande soit le même que les sous-types des commandes pilotées": "It is imperative that the subtype of the command is the same as the subtypes of the controlled commands",
        "Toutes les commandes dans le champs valeur doivent donc avoir le même sous-type": "All the commands in the value field must therefore have the same subtype",
        "Retour d'état virtuel": "Virtual status feedback",
        "Lors de l'utilisation d'un équipement qui ne possède pas de retour d'état et si cet équipement est commandé seulement par Jeedom, il est possible d'avoir un retour d'état virtuel": "When using equipment which does not have a status feedback and if this equipment is controlled only by Jeedom, it is possible to have a virtual status feedback",
        "Il faut pour cela créer un virtuel qui reprend les commandes actions (ex": "This requires creating a virtual that takes the actions commands (ex",
        "On & Off) de l'équipement et qui possède une commande info (l'état": "On & Off) of the equipment and which has an info command (the",
        "Il faut ensuite renseigner la colonne Paramètre pour chaque commande action, en sélectionnant le nom de la commande info (état) et en donnant la valeur qu'elle doit prendre": "You must then complete the Parameter column for each action command, by selecting the name of the info command (status) and giving the value it must take",
        "On peut aussi imaginer un virtuel qui allume\/éteint plusieurs lampes (commandes actions séparées par des &&) et avoir ainsi un état de cette commande générale": "We can also imagine a virtual one that turns on \/ off several lamps (actions commands separated by &&) and thus have a status of this general command",
        " Virtuel.": " Virtual.",
        " Virtuel?": " Virtual?",
        "Virtuel ": "Virtual ",
        " Virtuel]": " Virtual]",
        "[Virtuel]": "[Virtual]",
        "*Virtuel*": "*Virtual*",
        " Virtuel*": " Virtual*",
        " macro.": " macro.",
        " macro?": " macro?",
        "macro ": "macro ",
        " macro]": " macro]",
        "[macro]": "[macro]",
        "*macro*": "*macro*",
        " macro*": " macro*",
        " IMPORTANT.": " IMPORTANT.",
        " IMPORTANT?": " IMPORTANT?",
        "IMPORTANT ": "IMPORTANT ",
        " IMPORTANT]": " IMPORTANT]",
        "[IMPORTANT]": "[IMPORTANT]",
        "*IMPORTANT*": "*IMPORTANT*",
        " IMPORTANT*": " IMPORTANT*",
        " Configuration.": " Setup.",
        " Configuration?": " Setup?",
        "Configuration ": "Setup ",
        " Configuration]": " Setup]",
        "[Configuration]": "[Setup]",
        "*Configuration*": "*Setup*",
        " Configuration*": " Setup*",
        " Activer.": " Activate.",
        " Activer?": " Activate?",
        "Activer ": "Activate ",
        " Activer]": " Activate]",
        "[Activer]": "[Activate]",
        "*Activer*": "*Activate*",
        " Activer*": " Activate*",
        " Visible.": " Visible.",
        " Visible?": " Visible?",
        "Visible ": "Visible ",
        " Visible]": " Visible]",
        "[Visible]": "[Visible]",
        "*Visible*": "*Visible*",
        " Visible*": " Visible*",
        " Auto-actualisation.": " Self-actualization.",
        " Auto-actualisation?": " Self-actualization?",
        "Auto-actualisation ": "Self-actualization ",
        " Auto-actualisation]": " Self-actualization]",
        "[Auto-actualisation]": "[Self-actualization]",
        "*Auto-actualisation*": "*Self-actualization*",
        " Auto-actualisation*": " Self-actualization*",
        " ASTUCE.": " TRICK.",
        " ASTUCE?": " TRICK?",
        "ASTUCE ": "TRICK ",
        " ASTUCE]": " TRICK]",
        "[ASTUCE]": "[TRICK]",
        "*ASTUCE*": "*TRICK*",
        " ASTUCE*": " TRICK*",
        " Expression.": " Expression.",
        " Expression?": " Expression?",
        "Expression ": "Expression ",
        " Expression]": " Expression]",
        "[Expression]": "[Expression]",
        "*Expression*": "*Expression*",
        " Expression*": " Expression*",
        " Template.": " Template.",
        " Template?": " Template?",
        "Template ": "Template ",
        " Template]": " Template]",
        "[Template]": "[Template]",
        "*Template*": "*Template*",
        " Template*": " Template*",
        " Commandes.": " Orders.",
        " Commandes?": " Orders?",
        "Commandes ": "Orders ",
        " Commandes]": " Orders]",
        "[Commandes]": "[Orders]",
        "*Commandes*": "*Orders*",
        " Commandes*": " Orders*",
        " ID.": " ID.",
        " ID?": " ID?",
        "ID ": "ID ",
        " ID]": " ID]",
        "[ID]": "[ID]",
        "*ID*": "*ID*",
        " ID*": " ID*",
        " Nom.": " Name.",
        " Nom?": " Name?",
        "Nom ": "Name ",
        " Nom]": " Name]",
        "[Nom]": "[Name]",
        "*Nom*": "*Name*",
        " Nom*": " Name*",
        " actions.": " actions.",
        " actions?": " actions?",
        "actions ": "actions ",
        " actions]": " actions]",
        "[actions]": "[actions]",
        "*actions*": "*actions*",
        " actions*": " actions*",
        " Type.": " Type.",
        " Type?": " Type?",
        "Type ": "Type ",
        " Type]": " Type]",
        "[Type]": "[Type]",
        "*Type*": "*Type*",
        " Type*": " Type*",
        " Valeur.": " Value.",
        " Valeur?": " Value?",
        "Valeur ": "Value ",
        " Valeur]": " Value]",
        "[Valeur]": "[Value]",
        "*Valeur*": "*Value*",
        " Valeur*": " Value*",
        " infos.": " info.",
        " infos?": " info?",
        "infos ": "info ",
        " infos]": " info]",
        "[infos]": "[info]",
        "*infos*": "*info*",
        " infos*": " info*",
        " Options.": " Options.",
        " Options?": " Options?",
        "Options ": "Options ",
        " Options]": " Options]",
        "[Options]": "[Options]",
        "*Options*": "*Options*",
        " Options*": " Options*",
        " Afficher.": " Pin up.",
        " Afficher?": " Pin up?",
        "Afficher ": "Pin up ",
        " Afficher]": " Pin up]",
        "[Afficher]": "[Pin up]",
        "*Afficher*": "*Pin up*",
        " Afficher*": " Pin up*",
        " Historiser.": " Historize.",
        " Historiser?": " Historize?",
        "Historiser ": "Historize ",
        " Historiser]": " Historize]",
        "[Historiser]": "[Historize]",
        "*Historiser*": "*Historize*",
        " Historiser*": " Historize*",
        " Inverser.": " Reverse.",
        " Inverser?": " Reverse?",
        "Inverser ": "Reverse ",
        " Inverser]": " Reverse]",
        "[Inverser]": "[Reverse]",
        "*Inverser*": "*Reverse*",
        " Inverser*": " Reverse*",
        " 0\/max.": " 0 \/ max.",
        " 0\/max?": " 0 \/ max?",
        "0\/max ": "0 \/ max ",
        " 0\/max]": " 0 \/ max]",
        "[0\/max]": "[0 \/ max]",
        "*0\/max*": "*0 \/ max*",
        " 0\/max*": " 0 \/ max*",
        " Unité.": " Unit.",
        " Unité?": " Unit?",
        "Unité ": "Unit ",
        " Unité]": " Unit]",
        "[Unité]": "[Unit]",
        "*Unité*": "*Unit*",
        " Unité*": " Unit*",
        " Actions.": " Actions.",
        " Actions?": " Actions?",
        "Actions ": "Actions ",
        " Actions]": " Actions]",
        "[Actions]": "[Actions]",
        "*Actions*": "*Actions*",
        " Actions*": " Actions*",
        " Tester.": " Test.",
        " Tester?": " Test?",
        "Tester ": "Test ",
        " Tester]": " Test]",
        "[Tester]": "[Test]",
        "*Tester*": "*Test*",
        " Tester*": " Test*",
        " Supprimer.": " To delete.",
        " Supprimer?": " To delete?",
        "Supprimer ": "To delete ",
        " Supprimer]": " To delete]",
        "[Supprimer]": "[To delete]",
        "*Supprimer*": "*To delete*",
        " Supprimer*": " To delete*",
        " signe.": " sign.",
        " signe?": " sign?",
        "signe ": "sign ",
        " signe]": " sign]",
        "[signe]": "[sign]",
        "*signe*": "*sign*",
        " signe*": " sign*",
        " INFORMATION.": " INFORMATION.",
        " INFORMATION?": " INFORMATION?",
        "INFORMATION ": "INFORMATION ",
        " INFORMATION]": " INFORMATION]",
        "[INFORMATION]": "[INFORMATION]",
        "*INFORMATION*": "*INFORMATION*",
        " INFORMATION*": " INFORMATION*",
        " Rafraichir.": " Refresh.",
        " Rafraichir?": " Refresh?",
        "Rafraichir ": "Refresh ",
        " Rafraichir]": " Refresh]",
        "[Rafraichir]": "[Refresh]",
        "*Rafraichir*": "*Refresh*",
        " Rafraichir*": " Refresh*",
        " et.": " and.",
        " et?": " and?",
        "et ": "and ",
        " et]": " and]",
        "[et]": "[and]",
        "*et*": "*and*",
        " et*": " and*"
    }
}