{
    "changelog.md": {
        "Changelog Virtuel": "Registro de cambios virtual",
        "Pour rappel s'il n'y a pas d'information sur la mise à jour, c'est que celle-ci concerne uniquement de la mise à jour de documentation, de traduction ou de texte": "Como recordatorio si no hay información sobre la actualización, significa que solo se refiere a la actualización de documentación, traducción o texto",
        "16\/05\/2020": "16\/05\/2020",
        "Correction d'un soucis de remonté en double des commandes de type information": "Corrección de un problema con comandos de tipo de información duplicados",
        "23\/10\/2019": "23\/10\/2019",
        "Mise à jour de la doc": "Actualizando el documento",
        "Supression forcé des \" lors d'un calcul sur une commande": "Eliminación forzada de \"durante un cálculo en un pedido",
        "Correction de bug de calcul si le résultat à pour valeur\"Faux": "Corrección del error de cálculo si el resultado es \"Falso\"",
        "10\/09\/2019": "10\/09\/2019",
        "Correction de l'arrondit forcé sur 2 chiffres sur les commandes numérique": "Corrección de redondeo forzado a 2 dígitos en controles digitales",
        "Ajout d'un systeme de template pour créer des équipements rapidement": "Agregar un sistema de plantillas para crear equipos rápidamente",
        "Correction de bugs": "Correcciones de errores",
        "26\/04\/2019": "26\/04\/2019",
        "22\/03\/2019": "22\/03\/2019",
        "Ajout d'une securité en cas de boucle infini": "Adición de seguridad en caso de bucle infinito",
        "18\/03\/2019": "18\/03\/2019",
        "13\/03\/2019": "13\/03\/2019",
        "22\/01\/2019": "22\/01\/2019",
        "21\/01\/2019": "21\/01\/2019",
        "Correction d'un bug sur les valeurs déclenchant une mise à jour d'une commande info": "Corrección de un error en los valores que desencadenan una actualización de un comando de información",
        "Correction de l'erreur lors de la copie d'un équipement si la commande Rafraichir existe": "Corrección del error al copiar un dispositivo si existe el comando Actualizar",
        "Ajout du testeur d'expressions": "Adición del probador de expresión",
        " IMPORTANT.": " Importante.",
        " IMPORTANT?": " Importante?",
        "IMPORTANT ": "Importante ",
        "[IMPORTANT": "[Importante",
        "IMPORTANT]": "Importante]",
        "*IMPORTANT": "*Importante",
        "IMPORTANT*": "Importante*",
        " Optimisation.": " Optimización.",
        " Optimisation?": " Optimización?",
        "Optimisation ": "Optimización ",
        "[Optimisation": "[Optimización",
        "Optimisation]": "Optimización]",
        "*Optimisation": "*Optimización",
        "Optimisation*": "Optimización*"
    },
    "index.md": {
        "Plugin Virtuel": "Complemento virtual",
        "Le plugin Virtual (virtuel) permet la création de périphériques virtuels et de leurs propriétés": "El complemento virtual permite la creación de dispositivos virtuales y sus propiedades",
        "Nous nommerons un périphérique créé par ce plugin": "Vamos a nombrar un dispositivo creado por este complemento",
        "périphérique virtuel": "dispositivo virtual",
        "Un périphérique virtuel peut être créé pour les besoins suivants": "Se puede crear un dispositivo virtual para las siguientes necesidades",
        "consolider dans un seul périphérique des informations ou actions de plusieurs périphériques physiques\/virtuels ;": "consolidar información o acciones de varios dispositivos físicos \/ virtuales en un solo dispositivo;",
        "créer un périphérique alimenté par une source externe à Jeedom (Zibase, IPX800…) ;": "crear un periférico alimentado por una fuente externa a Jeedom (Zibase, IPX800, etc.);",
        "dupliquer un équipement pour le scinder en 2 par exemple ;": "equipo duplicado para dividirlo en 2, por ejemplo;",
        "effectuer un calcul sur plusieurs valeurs d'équipements ;": "realizar un cálculo en varios valores de equipo;",
        "exécuter de multiples actions (macro)": "ejecutar múltiples acciones (macro)",
        "Le plugin ne nécessite aucune configuration, il faut juste l'activer": "El complemento no requiere ninguna configuración, solo tiene que activarlo",
        "Configuration des équipements": "Configuración del equipo",
        "La configuration des équipements virtuels est accessible à partir du menu plugin": "Se puede acceder a la configuración de dispositivos virtuales desde el menú de complementos",
        "Voilà à quoi ressemble la page du plugin virtuel (ici avec déjà un équipement)": "Así es como se ve la página del complemento virtual (aquí con un equipo)",
        "Voilà à quoi ressemble la page de configuration d'un équipement virtuel": "Así es como se ve la página de configuración de un dispositivo virtual",
        "Comme à beaucoup d'endroits sur Jeedom, mettre la souris tout à gauche permet de faire apparaître un menu d'accès rapide (vous pouvez à partir de votre profil le laisser toujours visible)": "Como en muchos lugares de Jeedom, al colocar el mouse en el extremo izquierdo, aparece un menú de acceso rápido (siempre puede dejarlo visible desde su perfil)",
        "Vous retrouvez ici toute la configuration de votre équipement": "Aquí encontrarás toda la configuración de tu equipo",
        "Nom de l'équipement virtuel": "Nombre del dispositivo virtual",
        "nom de votre équipement virtuel": "nombre de su equipo virtual",
        "Objet parent": "Objeto padre",
        "indique l'objet parent auquel appartient l'équipement": "indica el objeto padre al que pertenece el equipo",
        "Catégorie": "Categoría",
        "les catégories de l'équipement (il peut appartenir à plusieurs catégories)": "categorías de equipos (puede pertenecer a varias categorías)",
        "permet de rendre votre équipement actif": "activa su equipo",
        "le rend visible sur le dashboard": "lo hace visible en el tablero",
        "vous permet de mettre des commentaires sur l'équipement": "le permite comentar sobre el equipo",
        "En haut à droite vous avez accès à 4 boutons": "En la parte superior derecha tiene acceso a 4 botones",
        "le testeur d'expressions identique à celui des scénarios pour vous faciliter la mise au point de certains virtuels": "El probador de expresión idéntico al de los escenarios para facilitar el desarrollo de algunos",
        "Importer équipement": "Equipo de importación",
        "permet de dupliquer automatiquement un équipement existant dans un virtuel (permet de gagner du temps pour scinder un équipement en 2 par exemple)": "permite duplicar automáticamente un equipo existente en uno virtual (ahorra tiempo para dividir un equipo en 2, por ejemplo)",
        "permet de dupliquer l'équipement courant": "duplica el equipo actual",
        "Avancée (roues crantées)": "Avanzado (ruedas con muescas)",
        "permet d'afficher les options avancées de l'équipement (commun à tous les plugins Jeedom)": "muestra opciones de equipos avanzados (comunes a todos los complementos de Jeedom)",
        "En-dessous vous retrouvez la liste des commandes": "A continuación encontrará la lista de pedidos",
        "le nom affiché sur le dashboard": "el nombre que se muestra en el tablero",
        "le type et le sous-type": "tipo y subtipo",
        "la valeur": "el valor",
        "permet de donner la valeur de la commande en fonction d'une autre commande, d'une clef (quand on fait un interrupteur virtuel), d'un calcul, etc": "permite dar el valor del comando de acuerdo con otro comando, una tecla (cuando hacemos un cambio virtual), un cálculo, etc",
        "Valeur de retour d'état\" et \"Durée avant retour d'état": "Valor de retroalimentación de estado \"y\" Duración antes de la retroalimentación de estado",
        "permet d'indiquer à Jeedom qu'après un changement sur l'information sa valeur doit revenir à Y, X min après le changement": "permite indicar a Jeedom que después de un cambio en la información, su valor debe volver a Y, X min después del cambio",
        "dans le cas d'un détecteur de présence qui n'émet que lors d'une détection de présence, il est utile de mettre par exemple 0 en valeur et 4 en durée, pour que 4 mn après une détection de mouvement (et s'il n'y a en pas eu de nouvelle(s) depuis) Jeedom remette la valeur de l'information à 0 (plus de mouvement détecté)": "en el caso de un detector de presencia que emite solo durante una detección de presencia, es útil establecer, por ejemplo, 0 en valor y 4 en duración, de modo que 4 minutos después de una detección de movimiento (y s ' no ha habido noticias desde entonces) Jeedom restablece el valor de la información a 0 (se detecta más movimiento)",
        "unité de la donnée (peut être vide)": "unidad de datos (puede estar vacía)",
        "permet d'historiser la donnée": "permite historizar los datos",
        "permet d'afficher la donnée sur le dashboard": "permite mostrar los datos en el tablero",
        "événement": "Evento",
        "dans le cas du RFXcom cette case doit toujours être cochée car on ne peut pas interroger un module RFXcom": "en el caso de RFXcom, esta casilla siempre debe estar marcada porque no puede interrogar a un módulo RFXcom",
        "min\/max": "min \/ max",
        "bornes de la donnée (peuvent être vides)": "límites de datos (pueden estar vacíos)",
        "configuration avancée (petites roues crantées)": "configuración avanzada (ruedas con muescas pequeñas)",
        "permet d'afficher la configuration avancée de la commande (méthode d'historisation, widget, etc.)": "muestra la configuración avanzada del comando (método de registro, widget, etc.)",
        "permet de tester la commande": "Se usa para probar el comando",
        "supprimer (signe -)": "eliminar (firmar -)",
        "permet de supprimer la commande": "permite eliminar el comando",
        "Interrupteur virtuel": "Interruptor virtual",
        "Pour faire un interrupteur virtuel, il vous faut ajouter 2 commandes virtuelles comme cela": "Para hacer un cambio virtual, debe agregar 2 comandos virtuales como este",
        "Puis vous sauvegardez et là Jeedom va automatiquement ajouter la commande d'information virtuelle": "Luego guarda y Jeedom agregará automáticamente el comando de información virtual",
        "Ajoutez dans les commandes \"action": "Agregar en la acción \"órdenes",
        "la commande": "El orden",
        "(cela permet à Jeedom de faire le lien avec la commande état)": "(esto le permite a Jeedom hacer el enlace con el comando de estado)",
        "Pour avoir un joli widget, il vous faut masquer la commande d'état": "Para tener un buen widget, debes ocultar el comando de estado",
        "Affectez un widget qui gère le retour d'état aux 2 commandes d'action, par exemple ici le widget light": "Asigne un widget que gestione los comentarios de estado a los 2 comandos de acción, por ejemplo, aquí el widget de luz",
        "Pour ce faire cliquez sur la petite roue crantée en face de la commande": "Para hacer esto, haga clic en la pequeña rueda con muesca en frente del control",
        "et dans le 2ème onglet sélectionnez": "y en la segunda pestaña seleccione",
        "comme widget": "como widget",
        "Enregistrez et faites de même pour la commande": "Guardar y hacer lo mismo para el pedido",
        "Et vous obtiendrez un joli widget qui changera d'état lors d'un clic": "Y obtendrá un buen widget que cambiará de estado al hacer clic",
        "Slider virtuel": "Control deslizante virtual",
        "Pour faire un slider virtuel, il faut ajouter une commande virtuelle comme cela": "Para hacer un control deslizante virtual, agregue un comando virtual como este",
        "Comme tout à l'heure après la sauvegarde, Jeedom va automatiquement créer la commande info": "Como antes después de la copia de seguridad, Jeedom creará automáticamente el comando de información",
        "Et comme tout à l'heure il est conseillé de lier l'action à la commande d'état et de masquer celle-ci": "Y como antes, es recomendable vincular la acción al comando de estado y ocultarlo",
        "Interrupteur de type toggle": "Interruptor de palanca",
        "Voilà comment faire un interrupteur de type toggle, pour cela il faut créer une commande virtuelle de ce type": "Así es como hacer un cambio de tipo alternar, para eso debe crear un comando virtual de este tipo",
        "Ensuite vous sauvegardez pour voir apparaître la commande d'état": "Luego guarda para ver aparecer el comando de estado",
        "Ici il faut dans la valeur de la commande action mettre": "Aquí es necesario en el valor del comando de acción poner",
        "(bien remplacer par votre propre commande) et lier l'état à la commande action (attention, il ne faut pas masquer la commande état cette fois)": "(reemplace con su propio comando) y vincule el estado con el comando de acción (tenga cuidado, esta vez no debe ocultar el comando de estado)",
        "Il faut aussi passer la commande info en sous-type binaire": "También debe colocar el comando de información en subtipo binario",
        "Pour faire un calcul sur de multiples commandes, c'est très facile": "Para hacer un cálculo en múltiples pedidos, es muy fácil",
        "Il suffit de créer une commande de type information virtuelle et dans le champs valeur mettre vos calculs": "Simplemente cree un orden de tipo de información virtual y en el campo de valor coloque sus cálculos",
        "Le testeur d'expression peut vous aider à cette étape pour valider": "El probador de expresiones puede ayudarlo con este paso para validar",
        "Par exemple, pour faire la moyenne de 2 températures": "Por ejemplo, para promediar 2 temperaturas",
        "Plusieurs points à réaliser correctement": "Varios puntos para hacer correctamente",
        "Bien choisir le sous-type en fonction du type d'information (ici calcul de moyenne donc c'est un numérique)": "Elija el subtipo de acuerdo con el tipo de información (aquí promediando, entonces es un valor numérico)",
        "Mettre des parenthèses dans les calculs, cela permet d'être sûr du résultat de l'opération": "Ponga paréntesis en los cálculos, esto le permite estar seguro del resultado de la operación",
        "Bien mettre l'unité": "Pon la unidad bien",
        "Cocher la case pour historiser si nécessaire": "Marque la casilla para iniciar sesión si es necesario",
        "Multiple commandes": "Pedidos múltiples",
        "Nous allons voir ici comment faire une commande qui va éteindre 2 lumières": "Veremos aquí cómo hacer un pedido que apagará 2 luces",
        "Rien de plus simple, il suffit de créer une commande virtuelle et de mettre les 2 commandes séparées par un": "Nada podría ser más simple, solo crea un pedido virtual y coloca los 2 pedidos separados por un",
        "Ici, il faut bien que le sous-type de la commande soit le même que les sous-types des commandes pilotées, donc toutes les commandes dans le champs valeur doivent avoir le même sous-type (toutes \"autre\", ou toutes \"slider\", ou toutes de type couleur)": "Aquí, el subtipo de comando debe ser el mismo que los subtipos de comando controlado, por lo que todos los comandos en el campo de valor deben tener el mismo subtipo (todos los controles deslizantes \"todos\" o todos \" \", o todo color)",
        "Retour d'état virtuel": "Retroalimentación de estado virtual",
        "Lors de l'utilisation d'un équipement qui ne possède pas de retour d'état et si cet équipement est commandé seulement par Jeedom, il est possible d'avoir un retour d'état virtuel": "Cuando se utiliza un equipo que no tiene una retroalimentación de estado y si este equipo está controlado solo por Jeedom, es posible tener una retroalimentación de estado virtual",
        "Il faut pour cela créer un virtuel qui reprend les commandes actions (ex": "Esto requiere crear un virtual que tome los comandos de acciones (ej",
        "On & Off) de l'équipement et qui possède une commande info (l'état)": "On & Off) del equipo y que tiene un comando de información (el estado)",
        "Il faut ensuite renseigner la colonne Paramètre pour chaque commande action, en sélectionnant le nom de la commande info (état) et en donnant la valeur qu'elle doit prendre": "Luego debe completar la columna Parámetro para cada comando de acción, seleccionando el nombre del comando de información (estado) y dando el valor que debe tomar",
        "On peut aussi imaginer un virtuel qui allume\/éteint plusieurs lampes (commandes actions séparées par des &&) et avoir ainsi un état de cette commande générale": "También podemos imaginar una virtual que enciende \/ apaga varias lámparas (comandos de acciones separados por &&) y, por lo tanto, tiene un estado de este comando general",
        "Affectation d'une valeur par API": "Asignación de un valor por API",
        "Il est possible de changer la valeur d'une information virtuelle par un": "Es posible cambiar el valor de la información virtual por un",
        "appel API": "Llamada API",
        "Attention à bien rajouter un \/jeedom après \\": "Tenga cuidado de agregar un \/ jeedom después de \\",
        "si nécessaire": "si es necesario",
        " Configuration.": " Configuración.",
        " Configuration?": " Configuración?",
        "Configuration ": "Configuración ",
        "[Configuration": "[Configuración",
        "Configuration]": "Configuración]",
        "*Configuration": "*Configuración",
        "Configuration*": "Configuración*",
        " Tip.": " Punta.",
        " Tip?": " Punta?",
        "Tip ": "Punta ",
        "[Tip": "[Punta",
        "Tip]": "Punta]",
        "*Tip": "*Punta",
        "Tip*": "Punta*",
        " Activer.": " Activar.",
        " Activer?": " Activar?",
        "Activer ": "Activar ",
        "[Activer": "[Activar",
        "Activer]": "Activar]",
        "*Activer": "*Activar",
        "Activer*": "Activar*",
        " Visible.": " Visible.",
        " Visible?": " Visible?",
        "Visible ": "Visible ",
        "[Visible": "[Visible",
        "Visible]": "Visible]",
        "*Visible": "*Visible",
        "Visible*": "Visible*",
        " Commentaire.": " Comentario.",
        " Commentaire?": " Comentario?",
        "Commentaire ": "Comentario ",
        "[Commentaire": "[Comentario",
        "Commentaire]": "Comentario]",
        "*Commentaire": "*Comentario",
        "Commentaire*": "Comentario*",
        " Expression.": " Expresión.",
        " Expression?": " Expresión?",
        "Expression ": "Expresión ",
        "[Expression": "[Expresión",
        "Expression]": "Expresión]",
        "*Expression": "*Expresión",
        "Expression*": "Expresión*",
        " Dupliquer.": " Duplicar.",
        " Dupliquer?": " Duplicar?",
        "Dupliquer ": "Duplicar ",
        "[Dupliquer": "[Duplicar",
        "Dupliquer]": "Duplicar]",
        "*Dupliquer": "*Duplicar",
        "Dupliquer*": "Duplicar*",
        " Exemple.": " Ejemplo.",
        " Exemple?": " Ejemplo?",
        "Exemple ": "Ejemplo ",
        "[Exemple": "[Ejemplo",
        "Exemple]": "Ejemplo]",
        "*Exemple": "*Ejemplo",
        "Exemple*": "Ejemplo*",
        " unité.": " Unidad.",
        " unité?": " Unidad?",
        "unité ": "Unidad ",
        "[unité": "[Unidad",
        "unité]": "Unidad]",
        "*unité": "*Unidad",
        "unité*": "Unidad*",
        " historiser.": " Guardar historial.",
        " historiser?": " Guardar historial?",
        "historiser ": "Guardar historial ",
        "[historiser": "[Guardar historial",
        "historiser]": "Guardar historial]",
        "*historiser": "*Guardar historial",
        "historiser*": "Guardar historial*",
        " afficher.": " Mostrar.",
        " afficher?": " Mostrar?",
        "afficher ": "Mostrar ",
        "[afficher": "[Mostrar",
        "afficher]": "Mostrar]",
        "*afficher": "*Mostrar",
        "afficher*": "Mostrar*",
        " Tester.": " Probar.",
        " Tester?": " Probar?",
        "Tester ": "Probar ",
        "[Tester": "[Probar",
        "Tester]": "Probar]",
        "*Tester": "*Probar",
        "Tester*": "Probar*",
        " Tutoriel.": " Tutorial.",
        " Tutoriel?": " Tutorial?",
        "Tutoriel ": "Tutorial ",
        "[Tutoriel": "[Tutorial",
        "Tutoriel]": "Tutorial]",
        "*Tutoriel": "*Tutorial",
        "Tutoriel*": "Tutorial*",
        " et.": " y.",
        " et?": " y?",
        "et ": "y ",
        "[et": "[y",
        "et]": "y]",
        "*et": "*y",
        "et*": "y*",
        " Note.": " Nota.",
        " Note?": " Nota?",
        "Note ": "Nota ",
        "[Note": "[Nota",
        "Note]": "Nota]",
        "*Note": "*Nota",
        "Note*": "Nota*"
    }
}