{
    "changelog.md": {
        "Changelog Virtuel": "Changelog Virtual",
        "Pour rappel s'il n'y a pas d'information sur la mise à jour, c'est que celle-ci concerne uniquement de la mise à jour de documentation, de traduction ou de texte": "Como lembrete, se não houver informações sobre a atualização, isso significa que se trata apenas da atualização da documentação, tradução ou texto",
        "16\/05\/2020": "16\/05\/2020",
        "Correction d'un soucis de remonté en double des commandes de type information": "Correção de um problema com comandos duplicados do tipo de informação",
        "23\/10\/2019": "23\/10\/2019",
        "Mise à jour de la doc": "Atualizando o documento",
        "Supression forcé des \" lors d'un calcul sur une commande": "Exclusão forçada de \"durante um cálculo em um pedido",
        "Correction de bug de calcul si le résultat à pour valeur\"Faux": "Correção do erro de cálculo se o resultado for \"False\"",
        "10\/09\/2019": "10\/09\/2019",
        "Correction de l'arrondit forcé sur 2 chiffres sur les commandes numérique": "Correção do arredondamento forçado para 2 dígitos nos controles digitais",
        "Ajout d'un systeme de template pour créer des équipements rapidement": "Adicionando um sistema de modelos para criar rapidamente equipamentos",
        "Correction de bugs": "Correções de bugs",
        "26\/04\/2019": "26\/04\/2019",
        "22\/03\/2019": "22\/03\/2019",
        "Ajout d'une securité en cas de boucle infini": "Adição de segurança em caso de loop infinito",
        "18\/03\/2019": "18\/03\/2019",
        "13\/03\/2019": "13\/03\/2019",
        "22\/01\/2019": "22\/01\/2019",
        "21\/01\/2019": "21\/01\/2019",
        "Correction d'un bug sur les valeurs déclenchant une mise à jour d'une commande info": "Correção de um erro nos valores que acionam a atualização de um comando info",
        "Correction de l'erreur lors de la copie d'un équipement si la commande Rafraichir existe": "Correção do erro ao copiar um dispositivo se o comando Atualizar existir",
        "Ajout du testeur d'expressions": "Adição do testador de expressão",
        " IMPORTANT.": " IMPORTANTE.",
        " IMPORTANT?": " IMPORTANTE?",
        "IMPORTANT ": "IMPORTANTE ",
        "[IMPORTANT": "[IMPORTANTE",
        "IMPORTANT]": "IMPORTANTE]",
        "*IMPORTANT": "*IMPORTANTE",
        "IMPORTANT*": "IMPORTANTE*",
        " Optimisation.": " Otimização.",
        " Optimisation?": " Otimização?",
        "Optimisation ": "Otimização ",
        "[Optimisation": "[Otimização",
        "Optimisation]": "Otimização]",
        "*Optimisation": "*Otimização",
        "Optimisation*": "Otimização*"
    },
    "index.md": {
        "Plugin Virtuel": "Plugin virtual",
        "Le plugin Virtual (virtuel) permet la création de périphériques virtuels et de leurs propriétés": "O plug-in virtual permite a criação de dispositivos virtuais e suas propriedades",
        "Nous nommerons un périphérique créé par ce plugin": "Vamos nomear um dispositivo criado por este plugin",
        "périphérique virtuel": "dispositivo virtual",
        "Un périphérique virtuel peut être créé pour les besoins suivants": "Um dispositivo virtual pode ser criado para as seguintes necessidades",
        "consolider dans un seul périphérique des informations ou actions de plusieurs périphériques physiques\/virtuels ;": "consolidar informações ou ações de vários dispositivos físicos \/ virtuais em um único dispositivo;",
        "créer un périphérique alimenté par une source externe à Jeedom (Zibase, IPX800…) ;": "crie um periférico alimentado por uma fonte externa ao Jeedom (Zibase, IPX800, etc.);",
        "dupliquer un équipement pour le scinder en 2 par exemple ;": "equipamento duplicado para dividi-lo em 2, por exemplo;",
        "effectuer un calcul sur plusieurs valeurs d'équipements ;": "realizar um cálculo em vários valores de equipamento;",
        "exécuter de multiples actions (macro)": "executar várias ações (macro)",
        "Le plugin ne nécessite aucune configuration, il faut juste l'activer": "O plugin não requer nenhuma configuração, você apenas precisa ativá-lo",
        "Configuration des équipements": "Configuração do equipamento",
        "La configuration des équipements virtuels est accessible à partir du menu plugin": "A configuração de dispositivos virtuais pode ser acessada no menu do plug-in",
        "Voilà à quoi ressemble la page du plugin virtuel (ici avec déjà un équipement)": "É assim que a página do plugin virtual se parece (aqui já com um equipamento)",
        "Voilà à quoi ressemble la page de configuration d'un équipement virtuel": "É assim que a página de configuração de um dispositivo virtual se parece",
        "Comme à beaucoup d'endroits sur Jeedom, mettre la souris tout à gauche permet de faire apparaître un menu d'accès rapide (vous pouvez à partir de votre profil le laisser toujours visible)": "Como em muitos lugares do Jeedom, colocar o mouse na extremidade esquerda permite que um menu de acesso rápido seja exibido (você sempre pode deixá-lo visível em seu perfil)",
        "Vous retrouvez ici toute la configuration de votre équipement": "Aqui você encontra toda a configuração do seu equipamento",
        "Nom de l'équipement virtuel": "Nome do dispositivo virtual",
        "nom de votre équipement virtuel": "nome do seu equipamento virtual",
        "Objet parent": "Objeto pai",
        "indique l'objet parent auquel appartient l'équipement": "indica o objeto pai ao qual o equipamento pertence",
        "Catégorie": "Categoria",
        "les catégories de l'équipement (il peut appartenir à plusieurs catégories)": "categorias de equipamentos (pode pertencer a várias categorias)",
        "permet de rendre votre équipement actif": "torna seu equipamento ativo",
        "le rend visible sur le dashboard": "torna visível no painel",
        "vous permet de mettre des commentaires sur l'équipement": "permite comentar sobre o equipamento",
        "En haut à droite vous avez accès à 4 boutons": "No canto superior direito, você tem acesso a 4 botões",
        "le testeur d'expressions identique à celui des scénarios pour vous faciliter la mise au point de certains virtuels": "o testador de expressão idêntico ao dos cenários para facilitar o desenvolvimento de algumas configurações virtuais",
        "Importer équipement": "Equipamento de importação",
        "permet de dupliquer automatiquement un équipement existant dans un virtuel (permet de gagner du temps pour scinder un équipement en 2 par exemple)": "permite duplicar automaticamente um equipamento existente em um virtual (economiza tempo para dividir um equipamento em 2, por exemplo)",
        "permet de dupliquer l'équipement courant": "duplica o equipamento atual",
        "Avancée (roues crantées)": "Avançado (rodas dentadas)",
        "permet d'afficher les options avancées de l'équipement (commun à tous les plugins Jeedom)": "exibe opções avançadas de equipamento (comuns a todos os plugins Jeedom)",
        "En-dessous vous retrouvez la liste des commandes": "Abaixo você encontra a lista de pedidos",
        "le nom affiché sur le dashboard": "o nome exibido no painel",
        "le type et le sous-type": "tipo e subtipo",
        "la valeur": "o valor",
        "permet de donner la valeur de la commande en fonction d'une autre commande, d'une clef (quand on fait un interrupteur virtuel), d'un calcul, etc": "permite dar o valor do comando de acordo com outro comando, uma chave (quando fazemos uma troca virtual), um cálculo, etc",
        "Valeur de retour d'état\" et \"Durée avant retour d'état": "Valor do feedback do status \"e\" Duração antes do feedback do status",
        "permet d'indiquer à Jeedom qu'après un changement sur l'information sa valeur doit revenir à Y, X min après le changement": "permite indicar a Jeedom que após uma alteração nas informações, seu valor deve retornar a Y, X min após a alteração",
        "dans le cas d'un détecteur de présence qui n'émet que lors d'une détection de présence, il est utile de mettre par exemple 0 en valeur et 4 en durée, pour que 4 mn après une détection de mouvement (et s'il n'y a en pas eu de nouvelle(s) depuis) Jeedom remette la valeur de l'information à 0 (plus de mouvement détecté)": "no caso de um detector de presença que emite apenas durante uma detecção de presença, é útil definir, por exemplo, 0 em valor e 4 em duração, de modo que 4 minutos após a detecção de movimento (e s ' não houve notícias desde então) Jeedom redefine o valor das informações para 0 (mais movimento detectado)",
        "unité de la donnée (peut être vide)": "unidade de dados (pode estar vazia)",
        "permet d'historiser la donnée": "permite historiar os dados",
        "permet d'afficher la donnée sur le dashboard": "permite exibir os dados no painel",
        "événement": "Evento",
        "dans le cas du RFXcom cette case doit toujours être cochée car on ne peut pas interroger un module RFXcom": "no caso do RFXcom, essa caixa sempre deve ser marcada, porque você não pode interrogar um módulo do RFXcom",
        "min\/max": "min \/ max",
        "bornes de la donnée (peuvent être vides)": "limites de dados (podem estar vazios)",
        "configuration avancée (petites roues crantées)": "configuração avançada (pequenas rodas dentadas)",
        "permet d'afficher la configuration avancée de la commande (méthode d'historisation, widget, etc.)": "exibe a configuração avançada do comando (método de registro, widget etc.)",
        "permet de tester la commande": "permite testar o comando",
        "supprimer (signe -)": "excluir (assinar -)",
        "permet de supprimer la commande": "permite excluir o comando",
        "Interrupteur virtuel": "Comutador virtual",
        "Pour faire un interrupteur virtuel, il vous faut ajouter 2 commandes virtuelles comme cela": "Para fazer um comutador virtual, você precisa adicionar 2 comandos virtuais como este",
        "Puis vous sauvegardez et là Jeedom va automatiquement ajouter la commande d'information virtuelle": "Então você salva e o Jeedom adiciona automaticamente o comando de informações virtuais",
        "Ajoutez dans les commandes \"action": "Adicionar à ação \"pedidos\"",
        "la commande": "A ordem",
        "(cela permet à Jeedom de faire le lien avec la commande état)": "(isso permite que o Jeedom faça o link com o comando state)",
        "Pour avoir un joli widget, il vous faut masquer la commande d'état": "Para ter um bom widget, você precisa ocultar o comando status",
        "Affectez un widget qui gère le retour d'état aux 2 commandes d'action, par exemple ici le widget light": "Atribua um widget que gerencia o feedback de status aos 2 comandos de ação, por exemplo, aqui o widget leve",
        "Pour ce faire cliquez sur la petite roue crantée en face de la commande": "Para fazer isso, clique na pequena roda dentada na frente do controle",
        "et dans le 2ème onglet sélectionnez": "e na 2ª guia, selecione",
        "comme widget": "como widget",
        "Enregistrez et faites de même pour la commande": "Salve e faça o mesmo para o pedido",
        "Et vous obtiendrez un joli widget qui changera d'état lors d'un clic": "E você terá um bom widget que mudará de estado quando clicado",
        "Slider virtuel": "Controle deslizante virtual",
        "Pour faire un slider virtuel, il faut ajouter une commande virtuelle comme cela": "Para criar um controle deslizante virtual, adicione um comando virtual como este",
        "Comme tout à l'heure après la sauvegarde, Jeedom va automatiquement créer la commande info": "Como antes após o backup, o Jeedom criará automaticamente o comando info",
        "Et comme tout à l'heure il est conseillé de lier l'action à la commande d'état et de masquer celle-ci": "E, como antes, é aconselhável vincular a ação ao comando status e ocultá-la",
        "Interrupteur de type toggle": "Interruptor de alavanca",
        "Voilà comment faire un interrupteur de type toggle, pour cela il faut créer une commande virtuelle de ce type": "É assim que se alterna o tipo, para isso é necessário criar um comando virtual desse tipo",
        "Ensuite vous sauvegardez pour voir apparaître la commande d'état": "Em seguida, salve para ver o comando status aparecer",
        "Ici il faut dans la valeur de la commande action mettre": "Aqui é necessário no valor do comando action colocar",
        "(bien remplacer par votre propre commande) et lier l'état à la commande action (attention, il ne faut pas masquer la commande état cette fois)": "(substitua por seu próprio comando) e vincule o estado ao comando action (tenha cuidado, você não deve ocultar o comando state desta vez)",
        "Il faut aussi passer la commande info en sous-type binaire": "Você também deve colocar o comando info no subtipo binário",
        "Pour faire un calcul sur de multiples commandes, c'est très facile": "Para fazer um cálculo em vários pedidos, é muito fácil",
        "Il suffit de créer une commande de type information virtuelle et dans le champs valeur mettre vos calculs": "Basta criar uma ordem do tipo de informação virtual e, no campo valor, colocar seus cálculos",
        "Le testeur d'expression peut vous aider à cette étape pour valider": "O testador de expressão pode ajudá-lo com esta etapa para validar",
        "Par exemple, pour faire la moyenne de 2 températures": "Por exemplo, para média de 2 temperaturas",
        "Plusieurs points à réaliser correctement": "Vários pontos a serem feitos corretamente",
        "Bien choisir le sous-type en fonction du type d'information (ici calcul de moyenne donc c'est un numérique)": "Escolha o subtipo de acordo com o tipo de informação (aqui a média é um número)",
        "Mettre des parenthèses dans les calculs, cela permet d'être sûr du résultat de l'opération": "Coloque parênteses nos cálculos, para ter certeza do resultado da operação",
        "Bien mettre l'unité": "Coloque a unidade bem",
        "Cocher la case pour historiser si nécessaire": "Marque a caixa para registrar, se necessário",
        "Multiple commandes": "Pedidos múltiplos",
        "Nous allons voir ici comment faire une commande qui va éteindre 2 lumières": "Veremos aqui como fazer um pedido que desligará 2 luzes",
        "Rien de plus simple, il suffit de créer une commande virtuelle et de mettre les 2 commandes séparées par un": "Nada poderia ser mais simples, basta criar um pedido virtual e colocar os 2 pedidos separados por um",
        "Ici, il faut bien que le sous-type de la commande soit le même que les sous-types des commandes pilotées, donc toutes les commandes dans le champs valeur doivent avoir le même sous-type (toutes \"autre\", ou toutes \"slider\", ou toutes de type couleur)": "Aqui, o subtipo de comando deve ser o mesmo que os subtipos de comando controlado; portanto, todos os comandos no campo de valor devem ter o mesmo subtipo (controle deslizante \"todos os outros\" ou todos \" \"ou todas as cores)",
        "Retour d'état virtuel": "Feedback do status virtual",
        "Lors de l'utilisation d'un équipement qui ne possède pas de retour d'état et si cet équipement est commandé seulement par Jeedom, il est possible d'avoir un retour d'état virtuel": "Ao usar equipamentos que não possuem feedback de status e se este equipamento é controlado apenas pela Jeedom, é possível ter um feedback de status virtual",
        "Il faut pour cela créer un virtuel qui reprend les commandes actions (ex": "Isso requer a criação de um virtual que execute os comandos de ações (ex",
        "On & Off) de l'équipement et qui possède une commande info (l'état)": "On & Off) do equipamento e que possui um comando info (o status)",
        "Il faut ensuite renseigner la colonne Paramètre pour chaque commande action, en sélectionnant le nom de la commande info (état) et en donnant la valeur qu'elle doit prendre": "Em seguida, você deve preencher a coluna Parâmetro para cada comando de ação, selecionando o nome do comando info (status) e fornecendo o valor que ele deve assumir",
        "On peut aussi imaginer un virtuel qui allume\/éteint plusieurs lampes (commandes actions séparées par des &&) et avoir ainsi un état de cette commande générale": "Também podemos imaginar um virtual que liga \/ desliga várias lâmpadas (comandos de ações separados por &&) e, portanto, tem um status desse comando geral",
        "Affectation d'une valeur par API": "Atribuindo um valor pela API",
        "Il est possible de changer la valeur d'une information virtuelle par un": "É possível alterar o valor da informação virtual por um",
        "appel API": "Chamada de API",
        "Attention à bien rajouter un \/jeedom après \\": "Tenha cuidado para adicionar um \/ jeedom após \\",
        "si nécessaire": "se necessário",
        " Configuration.": " Configuração.",
        " Configuration?": " Configuração?",
        "Configuration ": "Configuração ",
        "[Configuration": "[Configuração",
        "Configuration]": "Configuração]",
        "*Configuration": "*Configuração",
        "Configuration*": "Configuração*",
        " Tip.": " Dica.",
        " Tip?": " Dica?",
        "Tip ": "Dica ",
        "[Tip": "[Dica",
        "Tip]": "Dica]",
        "*Tip": "*Dica",
        "Tip*": "Dica*",
        " Activer.": " Ativar.",
        " Activer?": " Ativar?",
        "Activer ": "Ativar ",
        "[Activer": "[Ativar",
        "Activer]": "Ativar]",
        "*Activer": "*Ativar",
        "Activer*": "Ativar*",
        " Visible.": " Visivél.",
        " Visible?": " Visivél?",
        "Visible ": "Visivél ",
        "[Visible": "[Visivél",
        "Visible]": "Visivél]",
        "*Visible": "*Visivél",
        "Visible*": "Visivél*",
        " Commentaire.": " COMMENTAIRE.",
        " Commentaire?": " COMMENTAIRE?",
        "Commentaire ": "COMMENTAIRE ",
        "[Commentaire": "[COMMENTAIRE",
        "Commentaire]": "COMMENTAIRE]",
        "*Commentaire": "*COMMENTAIRE",
        "Commentaire*": "COMMENTAIRE*",
        " Expression.": " Expressão.",
        " Expression?": " Expressão?",
        "Expression ": "Expressão ",
        "[Expression": "[Expressão",
        "Expression]": "Expressão]",
        "*Expression": "*Expressão",
        "Expression*": "Expressão*",
        " Dupliquer.": " Duplicar.",
        " Dupliquer?": " Duplicar?",
        "Dupliquer ": "Duplicar ",
        "[Dupliquer": "[Duplicar",
        "Dupliquer]": "Duplicar]",
        "*Dupliquer": "*Duplicar",
        "Dupliquer*": "Duplicar*",
        " Exemple.": " Exemplo.",
        " Exemple?": " Exemplo?",
        "Exemple ": "Exemplo ",
        "[Exemple": "[Exemplo",
        "Exemple]": "Exemplo]",
        "*Exemple": "*Exemplo",
        "Exemple*": "Exemplo*",
        " unité.": " Unidade.",
        " unité?": " Unidade?",
        "unité ": "Unidade ",
        "[unité": "[Unidade",
        "unité]": "Unidade]",
        "*unité": "*Unidade",
        "unité*": "Unidade*",
        " historiser.": " Historicizar.",
        " historiser?": " Historicizar?",
        "historiser ": "Historicizar ",
        "[historiser": "[Historicizar",
        "historiser]": "Historicizar]",
        "*historiser": "*Historicizar",
        "historiser*": "Historicizar*",
        " afficher.": " Display.",
        " afficher?": " Display?",
        "afficher ": "Display ",
        "[afficher": "[Display",
        "afficher]": "Display]",
        "*afficher": "*Display",
        "afficher*": "Display*",
        " Tester.": " Teste.",
        " Tester?": " Teste?",
        "Tester ": "Teste ",
        "[Tester": "[Teste",
        "Tester]": "Teste]",
        "*Tester": "*Teste",
        "Tester*": "Teste*",
        " Tutoriel.": " Tutorial.",
        " Tutoriel?": " Tutorial?",
        "Tutoriel ": "Tutorial ",
        "[Tutoriel": "[Tutorial",
        "Tutoriel]": "Tutorial]",
        "*Tutoriel": "*Tutorial",
        "Tutoriel*": "Tutorial*",
        " et.": " e.",
        " et?": " e?",
        "et ": "e ",
        "[et": "[e",
        "et]": "e]",
        "*et": "*e",
        "et*": "e*",
        " Note.": " NOTA.",
        " Note?": " NOTA?",
        "Note ": "NOTA ",
        "[Note": "[NOTA",
        "Note]": "NOTA]",
        "*Note": "*NOTA",
        "Note*": "NOTA*"
    }
}