{
    "changelog.md": {
        "23\/10\/2019": "23\/10\/2019",
        "Mise à jour de la doc": "Atualizando o documento",
        "Supression forcé des \" lors d'un calcul sur une commande": "Exclusão forçada de \"durante um cálculo em um pedido",
        "Correction de bug de calcul si le résultat à pour valeur\"Faux": "Correção do erro de cálculo se o resultado for \"False\"",
        "10\/09\/2019": "10\/09\/2019",
        "Correction de l'arrondit forcé sur 2 chiffres sur les commandes numérique": "Correção do arredondamento forçado para 2 dígitos nos controles digitais",
        "Ajout d'un systeme de template pour créer des équipements rapidement": "Adicionando um sistema de modelos para criar rapidamente equipamentos",
        "Correction de bugs": "Correções de bugs",
        "26\/04\/2019": "26\/04\/2019",
        "22\/03\/2019": "22\/03\/2019",
        "Ajout d'une securité en cas de boucle infini": "Adição de segurança em caso de loop infinito",
        "18\/03\/2019": "18\/03\/2019",
        "13\/03\/2019": "13\/03\/2019",
        "22\/01\/2019": "22\/01\/2019",
        "21\/01\/2019": "21\/01\/2019",
        "Correction d'un bug sur les valeurs déclenchant une mise à jour d'une commande info": "Correção de um erro nos valores que acionam a atualização de um comando info",
        "Correction de l'erreur lors de la copie d'un équipement si la commande Rafraichir existe": "Correção do erro ao copiar um dispositivo se o comando Atualizar existir",
        "Ajout du testeur d'expressions": "Adição do testador de expressão",
        " Optimisation.": " Otimização.",
        " Optimisation?": " Otimização?",
        "Optimisation ": "Otimização ",
        "[Optimisation": "[Otimização",
        "Optimisation]": "Otimização]"
    },
    "index.md": {
        "Présentation": "1. Introdução",
        "Le plugin Virtual (virtuel) permet la création de périphériques virtuels": "O plug-in virtual permite a criação de dispositivos virtuais",
        "et de leurs propriétés": "e suas propriedades",
        "Nous nommerons un périphérique créé par ce plugin": "Vamos nomear um dispositivo criado por este plugin",
        "périphérique": "periférico",
        "Un périphérique virtuel peut être créé pour les besoins suivants": "Um dispositivo virtual pode ser criado para as seguintes necessidades",
        "consolider dans un seul périphérique des informations ou actions de": "consolide informações ou ações de um único dispositivo",
        "plusieurs périphériques physiques\/virtuels ;": "vários dispositivos físicos \/ virtuais;",
        "créer un périphérique alimenté par une source externe à Jeedom": "criar um dispositivo alimentado por uma fonte externa ao Jeedom",
        "(Zibase, IPX800…) ;": "(Zibase, IPX800 ...);",
        "dupliquer un équipement pour le scinder en 2 par exemple ;": "equipamento duplicado para dividi-lo em 2, por exemplo;",
        "effectuer un calcul sur plusieurs valeurs d'équipements ;": "realizar um cálculo em vários valores de equipamento;",
        "exécuter de multiples actions (macro)": "executar várias ações (macro)",
        "Le plugin ne nécessite aucune configuration, il faut juste l'activer": "O plugin não requer nenhuma configuração, você apenas precisa ativá-lo",
        "Configuration des équipements": "Configuração do equipamento",
        "La configuration des équipements virtuels est accessible à partir du": "A configuração dos dispositivos virtuais é acessível a partir do",
        "menu plugin": "menu de plugins",
        "Voilà à quoi ressemble la page du plugin virtuel (ici avec déjà un": "É assim que a página do plug-in virtual se parece (aqui, já com um",
        "Voilà à quoi ressemble la page de configuration d'un équipement virtuel": "É assim que a página de configuração de um dispositivo virtual se parece",
        "Comme à beaucoup d'endroits sur Jeedom, mettre la souris tout à gauche": "Como em muitos lugares em Jeedom, coloque o mouse na extremidade esquerda",
        "permet de faire apparaître un menu d'accès rapide (vous pouvez à": "abre um menu de acesso rápido (você pode",
        "partir de votre profil le laisser toujours visible)": "do seu perfil, deixe-o sempre visível)",
        "Vous retrouvez ici toute la configuration de votre équipement": "Aqui você encontra toda a configuração do seu equipamento",
        "Nom de l'équipement virtuel": "Nome do dispositivo virtual",
        "nom de votre équipement virtuel": "nome do seu equipamento virtual",
        "Objet parent": "Objeto pai",
        "indique l'objet parent auquel appartient": "indica o objeto pai ao qual pertence",
        "l'équipement": "o equipamento",
        "Catégorie": "Categoria",
        "les catégories de l'équipement (il peut appartenir à": "categorias de equipamentos (pode pertencer a",
        "plusieurs catégories)": "várias categorias)",
        "permet de rendre votre équipement actif": "torna seu equipamento ativo",
        "le rend visible sur le dashboard": "torna visível no painel",
        "vous permet de mettre des commentaires sur": "permite que você comente",
        "En haut à droite vous avez accès à 4 boutons": "No canto superior direito, você tem acesso a 4 botões",
        "le testeur d'expressions identique à celui des scénarios": "o testador de expressão idêntico ao dos cenários",
        "pour vous faciliter la mise au point de certains virtuels": "para facilitar o desenvolvimento de algumas",
        "Importer équipement": "Equipamento de importação",
        "permet de dupliquer automatiquement un": "permite duplicar automaticamente um",
        "équipement existant dans un virtuel (permet de gagner du temps pour": "equipamento existente em um ambiente virtual (economiza tempo para",
        "scinder un équipement en 2 par exemple)": "equipamento dividido em 2, por exemplo)",
        "permet de dupliquer l'équipement courant": "duplica o equipamento atual",
        "Avancée (roues crantées)": "Avançado (rodas dentadas)",
        "permet d'afficher les options": "exibe opções",
        "avancées de l'équipement (commun à tous les plugins Jeedom)": "avanços do equipamento (comuns a todos os plugins Jeedom)",
        "En-dessous vous retrouvez la liste des commandes": "Abaixo você encontra a lista de pedidos",
        "le nom affiché sur le dashboard": "o nome exibido no painel",
        "le type et le sous-type": "tipo e subtipo",
        "la valeur": "o valor",
        "permet de donner la valeur de la commande en fonction": "permite dar o valor do pedido de acordo",
        "d'une autre commande, d'une clef (quand on fait un interrupteur": "outro comando, uma chave (quando você faz uma troca",
        "virtuel), d'un calcul, etc": "), um cálculo etc.",
        "Valeur de retour d'état\" et \"Durée avant retour d'état": "Valor do feedback do status \"e\" Duração antes do feedback do status",
        "d'indiquer à Jeedom qu'après un changement sur l'information sa": "para indicar a Jeedom que após uma alteração nas informações",
        "valeur doit revenir à Y, X min après le changement": "O valor deve retornar para Y, X min após a alteração",
        "le cas d'un détecteur de présence qui n'émet que lors d'une": "no caso de um detector de presença que emite apenas durante um",
        "détection de présence, il est utile de mettre par exemple 0 en": "detecção de presença, é útil definir, por exemplo, 0",
        "valeur et 4 en durée, pour que 4 mn après une détection de mouvement": "valor e 4 de duração, de modo que 4 minutos após a detecção de movimento",
        "(et s'il n'y a en pas eu de nouvelle(s) depuis) Jeedom remette la": "(e se não houver notícias desde então) Jeedom retira o",
        "valeur de l'information à 0 (plus de mouvement détecté)": "valor da informação em 0 (não é mais detectado movimento)",
        "unité de la donnée (peut être vide)": "unidade de dados (pode estar vazia)",
        "permet d'historiser la donnée": "permite historiar os dados",
        "permet d'afficher la donnée sur le dashboard": "permite exibir os dados no painel",
        "événement": "Evento",
        "dans le cas du RFXcom cette case doit toujours être": "no caso da RFXcom, essa caixa deve sempre ser",
        "cochée car on ne peut pas interroger un module RFXcom": "verificado porque você não pode consultar um módulo RFXcom",
        "min\/max": "min \/ max",
        "bornes de la donnée (peuvent être vides)": "limites de dados (podem estar vazios)",
        "configuration avancée (petites roues crantées)": "configuração avançada (pequenas rodas dentadas)",
        "permet d'afficher": "permite exibir",
        "la configuration avancée de la commande (méthode d'historisation": "configuração avançada do comando (método de historização",
        "widget, etc.)": "widget etc.)",
        "permet de tester la commande": "permite testar o comando",
        "supprimer (signe -)": "excluir (assinar -)",
        "permet de supprimer la commande": "permite excluir o comando",
        "Interrupteur virtuel": "Comutador virtual",
        "Pour faire un interrupteur virtuel, il vous faut ajouter 2 commandes": "Para fazer um comutador virtual, você precisa adicionar 2 comandos",
        "virtuelles comme cela": "virtual como este",
        "Puis vous sauvegardez et là Jeedom va automatiquement ajouter la": "Então você salva e o Jeedom adiciona automaticamente o",
        "commande d'information virtuelle": "ordem de informação virtual",
        "Ajoutez dans les commandes \"action\" `On` et `Off`, la commande `Etat`": "Adicione nos comandos \"action\" `On` e` Off`, o comando `State`",
        "(cela permet à Jeedom de faire le lien avec la commande état)": "(isso permite que o Jeedom faça o link com o comando state)",
        "Pour avoir un joli widget, il vous faut masquer la commande d'état": "Para ter um bom widget, você precisa ocultar o comando status",
        "Affectez un widget qui gère le retour d'état aux 2 commandes d'action": "Atribua um widget que gerencia o feedback de status aos 2 comandos de ação",
        "par exemple ici le widget light": "por exemplo, aqui o widget de luz",
        "Pour ce faire cliquez sur la petite": "Para fazer isso, clique no pequeno",
        "roue crantée en face de la commande `On` et dans le 2ème onglet": "roda dentada na frente do comando \"On\" e na 2ª guia",
        "sélectionnez `light` comme widget": "selecione `light 'como widget",
        "Enregistrez et faites de même pour la commande `Off`": "Salve e faça o mesmo para o comando `Off '",
        "Et vous obtiendrez": "E você terá",
        "un joli widget qui changera d'état lors d'un clic": "um bom widget que mudará de estado quando clicado",
        "Slider virtuel": "Controle deslizante virtual",
        "Pour faire un slider virtuel, il faut ajouter une commande virtuelle": "Para criar um controle deslizante virtual, adicione um comando virtual",
        "comme cela": "assim",
        "Comme tout à l'heure après la sauvegarde, Jeedom va automatiquement": "Como antes após o backup, o Jeedom automaticamente",
        "créer la commande info": "crie o comando info",
        "Et comme tout à l'heure il est conseillé de lier l'action à la commande": "E como antes, é aconselhável vincular a ação ao comando",
        "d'état et de masquer celle-ci": "e esconda",
        "Interrupteur de type toggle": "Interruptor de alavanca",
        "Voilà comment faire un interrupteur de type toggle, pour cela il faut": "É assim que se alterna o tipo de alternância.",
        "créer une commande virtuelle de ce type": "crie uma ordem virtual",
        "Ensuite vous sauvegardez pour voir apparaître la commande d'état": "Em seguida, salve para ver o comando status aparecer",
        "Ici il faut dans la valeur de la commande action mettre": "Aqui é necessário no valor do comando action colocar",
        "`not(\\#[...][...][Etat]#)` (bien remplacer par votre propre commande) et": "`not (\\# [...] [...] [State] #)` (substitua por seu próprio comando) e",
        "lier l'état à la commande action (attention, il ne faut pas masquer la": "vincule o status ao comando action (tenha cuidado, não oculte o",
        "commande état cette fois)": "comando state desta vez)",
        "Il faut aussi passer la commande info en": "Você também deve colocar o comando info em",
        "sous-type binaire": "subtipo binário",
        "Pour faire un calcul sur de multiples commandes, c'est très facile": "Para fazer um cálculo em vários pedidos, é muito fácil",
        "suffit de créer une commande de type information virtuelle et dans le": "basta criar um comando do tipo de informação virtual e no",
        "champs valeur mettre vos calculs": "campos de valor colocar seus cálculos",
        "Le testeur d'expression peut vous aider": "O testador de expressão pode ajudá-lo",
        "à cette étape pour valider": "nesta fase para validar",
        "Par exemple, pour faire la moyenne de": "Por exemplo, para média",
        "2 températures": "2 temperaturas",
        "Plusieurs points à réaliser correctement": "Vários pontos a serem feitos corretamente",
        "Bien choisir le sous-type en fonction du type d'information (ici": "Escolha o subtipo de acordo com o tipo de informação (aqui",
        "calcul de moyenne donc c'est un numérique)": "média, por isso é um numérico)",
        "Mettre des parenthèses dans les calculs, cela permet d'être sûr du": "Coloque parênteses nos cálculos, isso permite que você tenha certeza da",
        "résultat de l'opération": "resultado da operação",
        "Bien mettre l'unité": "Coloque a unidade bem",
        "Cocher la case pour historiser si nécessaire": "Marque a caixa para registrar, se necessário",
        "Multiple commandes": "Pedidos múltiplos",
        "Nous allons voir ici comment faire une commande qui va éteindre 2": "Veremos aqui como fazer um pedido que será desativado 2",
        "lumières. Rien de plus simple, il suffit de créer une commande virtuelle": "luzes. Nada mais simples, basta criar um pedido virtual",
        "et de mettre les 2 commandes séparées par un `&&`": "e coloque os 2 comandos separados por um `&&`",
        "Ici, il faut bien que le sous-type de la commande soit le même que les": "Aqui, o subtipo de comando deve ser o mesmo que o",
        "sous-types des commandes pilotées, donc toutes les commandes dans le": "subtipos dos comandos controlados, portanto, todos os comandos no",
        "champs valeur doivent avoir le même sous-type (toutes \"autre\", ou toutes": "campos de valor devem ter o mesmo subtipo (todos \"outros\" ou todos",
        "slider\", ou toutes de type couleur)": "controle deslizante \"ou todo o tipo de cor)",
        "Retour d'état virtuel": "Feedback do status virtual",
        "Lors de l'utilisation d'un équipement qui ne possède pas de retour": "Ao usar equipamentos sem retorno",
        "d'état et si cet équipement est commandé seulement par Jeedom, il est": "status e se este equipamento for solicitado apenas pela Jeedom, será",
        "possible d'avoir un retour d'état virtuel": "possível ter um feedback virtual",
        "Il faut pour cela créer un": "Isso requer a criação de um",
        "virtuel qui reprend les commandes actions (ex": "virtual que executa comandos de ação (ex",
        "On & Off) de l'équipement": "On & Off) do equipamento",
        "et qui possède une commande info (l'état)": "e quem tem um comando info (status)",
        "Il faut ensuite renseigner la": "Então você tem que preencher o",
        "colonne Paramètre pour chaque commande action, en sélectionnant le nom": "Coluna de parâmetros para cada comando de ação, selecionando o nome",
        "de la commande info (état) et en donnant la valeur qu'elle doit prendre": "do comando info (status) e fornecendo o valor que ele deve levar",
        "On peut aussi imaginer un virtuel qui allume\/éteint plusieurs lampes": "Também podemos imaginar um virtual que liga \/ desliga várias lâmpadas",
        "(commandes actions séparées par des &&) et avoir ainsi un état de cette": "(comandos de ações separados por &&) e, portanto, têm um status",
        "commande générale": "ordem geral",
        "Affectation d'une valeur par API": "Atribuindo um valor pela API",
        "Il est possible de changer la valeur d'une information virtuelle par un": "É possível alterar o valor da informação virtual por um",
        "appel API": "Chamada de API",
        "Attention à bien rajouter un \/jeedom après \\#IP\\_JEEDOM\\# si nécessaire": "Tenha cuidado para adicionar um \/ jeedom após \\#IP\\_JEEDOM \\#, se necessário",
        " virtuel.": " virtual.",
        " virtuel?": " virtual?",
        "virtuel ": "virtual ",
        "[virtuel": "[virtual",
        "virtuel]": "virtual]",
        " Configuration.": " Configuração.",
        " Configuration?": " Configuração?",
        "Configuration ": "Configuração ",
        "[Configuration": "[Configuração",
        "Configuration]": "Configuração]",
        " équipement).": " equipamento).",
        " équipement)?": " equipamento)?",
        "équipement) ": "equipamento) ",
        "[équipement)": "[equipamento)",
        "équipement)]": "equipamento)]",
        " Tip.": " Dica.",
        " Tip?": " Dica?",
        "Tip ": "Dica ",
        "[Tip": "[Dica",
        "Tip]": "Dica]",
        " Activer.": " Ativar.",
        " Activer?": " Ativar?",
        "Activer ": "Ativar ",
        "[Activer": "[Ativar",
        "Activer]": "Ativar]",
        " Visible.": " Visivél.",
        " Visible?": " Visivél?",
        "Visible ": "Visivél ",
        "[Visible": "[Visivél",
        "Visible]": "Visivél]",
        " Commentaire.": " COMMENTAIRE.",
        " Commentaire?": " COMMENTAIRE?",
        "Commentaire ": "COMMENTAIRE ",
        "[Commentaire": "[COMMENTAIRE",
        "Commentaire]": "COMMENTAIRE]",
        " Expression.": " Expressão.",
        " Expression?": " Expressão?",
        "Expression ": "Expressão ",
        "[Expression": "[Expressão",
        "Expression]": "Expressão]",
        " Dupliquer.": " Duplicar.",
        " Dupliquer?": " Duplicar?",
        "Dupliquer ": "Duplicar ",
        "[Dupliquer": "[Duplicar",
        "Dupliquer]": "Duplicar]",
        " permet.": " permite.",
        " permet?": " permite?",
        "permet ": "permite ",
        "[permet": "[permite",
        "permet]": "permite]",
        " Exemple.": " Exemplo.",
        " Exemple?": " Exemplo?",
        "Exemple ": "Exemplo ",
        "[Exemple": "[Exemplo",
        "Exemple]": "Exemplo]",
        " dans.": " Dans.",
        " dans?": " Dans?",
        "dans ": "Dans ",
        "[dans": "[Dans",
        "dans]": "Dans]",
        " unité.": " Unidade.",
        " unité?": " Unidade?",
        "unité ": "Unidade ",
        "[unité": "[Unidade",
        "unité]": "Unidade]",
        " historiser.": " Historicizar.",
        " historiser?": " Historicizar?",
        "historiser ": "Historicizar ",
        "[historiser": "[Historicizar",
        "historiser]": "Historicizar]",
        " afficher.": " Display.",
        " afficher?": " Display?",
        "afficher ": "Display ",
        "[afficher": "[Display",
        "afficher]": "Display]",
        " Tester.": " Teste.",
        " Tester?": " Teste?",
        "Tester ": "Teste ",
        "[Tester": "[Teste",
        "Tester]": "Teste]",
        " Tutoriel.": " Tutorial.",
        " Tutoriel?": " Tutorial?",
        "Tutoriel ": "Tutorial ",
        "[Tutoriel": "[Tutorial",
        "Tutoriel]": "Tutorial]",
        " Calcul.": " Cálculo.",
        " Calcul?": " Cálculo?",
        "Calcul ": "Cálculo ",
        "[Calcul": "[Cálculo",
        "Calcul]": "Cálculo]",
        " Il.": " Ele.",
        " Il?": " Ele?",
        "Il ": "Ele ",
        "[Il": "[Ele",
        "Il]": "Ele]",
        " Note.": " NOTA.",
        " Note?": " NOTA?",
        "Note ": "NOTA ",
        "[Note": "[NOTA",
        "Note]": "NOTA]"
    }
}